Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
extern volatile __CFGPGbits_t CFGPGbits __asm__ ("CFGPG") __attribute__((section("sfrs"), address(0xBF8000E0)));
extern volatile uint32_t        CFGPGCLR __attribute__((section("sfrs"),address(0xBF8000E4)));
extern volatile uint32_t        CFGPGSET __attribute__((section("sfrs"),address(0xBF8000E8)));
extern volatile uint32_t        CFGPGINV __attribute__((section("sfrs"),address(0xBF8000EC)));
#define CFGCON2 CFGCON2
extern volatile uint32_t   CFGCON2 __attribute__((section("sfrs"), address(0xBF800110)));
typedef struct {
  uint32_t EEWS:8;
  uint32_t :8;
  uint32_t ENPGA1:1;
  uint32_t ENPGA2:1;
  uint32_t ENPGA3:1;
  uint32_t :1;
  uint32_t ENPGA5:1;
} __CFGCON2bits_t;
extern volatile __CFGCON2bits_t CFGCON2bits __asm__ ("CFGCON2") __attribute__((section("sfrs"), address(0xBF800110)));
extern volatile uint32_t        CFGCON2CLR __attribute__((section("sfrs"),address(0xBF800114)));
extern volatile uint32_t        CFGCON2SET __attribute__((section("sfrs"),address(0xBF800118)));
extern volatile uint32_t        CFGCON2INV __attribute__((section("sfrs"),address(0xBF80011C)));
#define CHECON CHECON
extern volatile uint32_t   CHECON __attribute__((section("sfrs"), address(0xBF800800)));
typedef struct {
  uint32_t PFMWS:3;
  uint32_t :1;
  uint32_t PREFEN:2;
  uint32_t :2;
  uint32_t PFMAWSEN:1;
  uint32_t :3;
  uint32_t CHEPERFEN:1;
  uint32_t :3;
  uint32_t ICHECOH:1;
  uint32_t DCHECOH:1;
  uint32_t PERCHECOH:1;
  uint32_t :1;
  uint32_t ICHEINV:1;
  uint32_t DCHEINV:1;
  uint32_t PERCHEINV:1;
  uint32_t :1;
  uint32_t ICHEEN:1;
  uint32_t DCHEEN:1;
  uint32_t PERCHEEN:1;
} __CHECONbits_t;
extern volatile __CHECONbits_t CHECONbits __asm__ ("CHECON") __attribute__((section("sfrs"), address(0xBF800800)));
extern volatile uint32_t        CHECONCLR __attribute__((section("sfrs"),address(0xBF800804)));
extern volatile uint32_t        CHECONSET __attribute__((section("sfrs"),address(0xBF800808)));
extern volatile uint32_t        CHECONINV __attribute__((section("sfrs"),address(0xBF80080C)));
#define CHEHIT CHEHIT
extern volatile uint32_t   CHEHIT __attribute__((section("sfrs"), address(0xBF800820)));
typedef struct {
  uint32_t CHEHIT:32;
} __CHEHITbits_t;
extern volatile __CHEHITbits_t CHEHITbits __asm__ ("CHEHIT") __attribute__((section("sfrs"), address(0xBF800820)));
#define CHEMIS CHEMIS
extern volatile uint32_t   CHEMIS __attribute__((section("sfrs"), address(0xBF800830)));
typedef struct {
  uint32_t CHEMIS:32;
} __CHEMISbits_t;
extern volatile __CHEMISbits_t CHEMISbits __asm__ ("CHEMIS") __attribute__((section("sfrs"), address(0xBF800830)));
#define NVMCON NVMCON
extern volatile uint32_t   NVMCON __attribute__((section("sfrs"), address(0xBF800A00)));
typedef union {
  struct {
    uint32_t NVMOP:4;
    uint32_t :2;
    uint32_t BFSWAP:1;
    uint32_t PFSWAP:1;
    uint32_t :4;
    uint32_t LVDERR:1;
    uint32_t WRERR:1;
    uint32_t WREN:1;
    uint32_t WR:1;
  };
  struct {
    uint32_t NVMOP0:1;
    uint32_t NVMOP1:1;
    uint32_t NVMOP2:1;
    uint32_t NVMOP3:1;
    uint32_t :3;
    uint32_t SWAP:1;
  };
  struct {
    uint32_t PROGOP:4;
  };
  struct {
    uint32_t PROGOP0:1;
    uint32_t PROGOP1:1;
    uint32_t PROGOP2:1;
    uint32_t PROGOP3:1;
  };
  struct {
    uint32_t w:32;
  };
} __NVMCONbits_t;
extern volatile __NVMCONbits_t NVMCONbits __asm__ ("NVMCON") __attribute__((section("sfrs"), address(0xBF800A00)));
extern volatile uint32_t        NVMCONCLR __attribute__((section("sfrs"),address(0xBF800A04)));
extern volatile uint32_t        NVMCONSET __attribute__((section("sfrs"),address(0xBF800A08)));
extern volatile uint32_t        NVMCONINV __attribute__((section("sfrs"),address(0xBF800A0C)));
#define NVMKEY NVMKEY
extern volatile uint32_t   NVMKEY __attribute__((section("sfrs"), address(0xBF800A10)));
#define NVMADDR NVMADDR
extern volatile uint32_t   NVMADDR __attribute__((section("sfrs"), address(0xBF800A20)));
extern volatile uint32_t        NVMADDRCLR __attribute__((section("sfrs"),address(0xBF800A24)));
extern volatile uint32_t        NVMADDRSET __attribute__((section("sfrs"),address(0xBF800A28)));
extern volatile uint32_t        NVMADDRINV __attribute__((section("sfrs"),address(0xBF800A2C)));
#define NVMDATA0 NVMDATA0
extern volatile uint32_t   NVMDATA0 __attribute__((section("sfrs"), address(0xBF800A30)));
extern volatile uint32_t        NVMDATA0CLR __attribute__((section("sfrs"),address(0xBF800A34)));
extern volatile uint32_t        NVMDATA0SET __attribute__((section("sfrs"),address(0xBF800A38)));
extern volatile uint32_t        NVMDATA0INV __attribute__((section("sfrs"),address(0xBF800A3C)));
#define NVMDATA1 NVMDATA1
extern volatile uint32_t   NVMDATA1 __attribute__((section("sfrs"), address(0xBF800A40)));
extern volatile uint32_t        NVMDATA1CLR __attribute__((section("sfrs"),address(0xBF800A44)));
extern volatile uint32_t        NVMDATA1SET __attribute__((section("sfrs"),address(0xBF800A48)));
extern volatile uint32_t        NVMDATA1INV __attribute__((section("sfrs"),address(0xBF800A4C)));
#define NVMDATA2 NVMDATA2
extern volatile uint32_t   NVMDATA2 __attribute__((section("sfrs"), address(0xBF800A50)));
extern volatile uint32_t        NVMDATA2CLR __attribute__((section("sfrs"),address(0xBF800A54)));
extern volatile uint32_t        NVMDATA2SET __attribute__((section("sfrs"),address(0xBF800A58)));
extern volatile uint32_t        NVMDATA2INV __attribute__((section("sfrs"),address(0xBF800A5C)));
#define NVMDATA3 NVMDATA3
extern volatile uint32_t   NVMDATA3 __attribute__((section("sfrs"), address(0xBF800A60)));
extern volatile uint32_t        NVMDATA3CLR __attribute__((section("sfrs"),address(0xBF800A64)));
extern volatile uint32_t        NVMDATA3SET __attribute__((section("sfrs"),address(0xBF800A68)));
extern volatile uint32_t        NVMDATA3INV __attribute__((section("sfrs"),address(0xBF800A6C)));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint32_t   NVMSRCADDR __attribute__((section("sfrs"), address(0xBF800A70)));
extern volatile uint32_t        NVMSRCADDRCLR __attribute__((section("sfrs"),address(0xBF800A74)));
extern volatile uint32_t        NVMSRCADDRSET __attribute__((section("sfrs"),address(0xBF800A78)));
extern volatile uint32_t        NVMSRCADDRINV __attribute__((section("sfrs"),address(0xBF800A7C)));
#define NVMPWP NVMPWP
extern volatile uint32_t   NVMPWP __attribute__((section("sfrs"), address(0xBF800A80)));
typedef struct {
  uint32_t PWP:24;
  uint32_t :7;
  uint32_t PWPULOCK:1;
} __NVMPWPbits_t;
extern volatile __NVMPWPbits_t NVMPWPbits __asm__ ("NVMPWP") __attribute__((section("sfrs"), address(0xBF800A80)));
extern volatile uint32_t        NVMPWPCLR __attribute__((section("sfrs"),address(0xBF800A84)));
extern volatile uint32_t        NVMPWPSET __attribute__((section("sfrs"),address(0xBF800A88)));
extern volatile uint32_t        NVMPWPINV __attribute__((section("sfrs"),address(0xBF800A8C)));
#define NVMBWP NVMBWP
extern volatile uint32_t   NVMBWP __attribute__((section("sfrs"), address(0xBF800A90)));
typedef struct {
  uint32_t UBWP0:1;
  uint32_t UBWP1:1;
  uint32_t UBWP2:1;
  uint32_t UBWP3:1;
  uint32_t UBWP4:1;
  uint32_t :2;
  uint32_t UBWPULOCK:1;
  uint32_t LBWP0:1;
  uint32_t LBWP1:1;
  uint32_t LBWP2:1;
  uint32_t LBWP3:1;
  uint32_t LBWP4:1;
  uint32_t :2;
  uint32_t LBWPULOCK:1;
} __NVMBWPbits_t;
extern volatile __NVMBWPbits_t NVMBWPbits __asm__ ("NVMBWP") __attribute__((section("sfrs"), address(0xBF800A90)));
extern volatile uint32_t        NVMBWPCLR __attribute__((section("sfrs"),address(0xBF800A94)));
extern volatile uint32_t        NVMBWPSET __attribute__((section("sfrs"),address(0xBF800A98)));
extern volatile uint32_t        NVMBWPINV __attribute__((section("sfrs"),address(0xBF800A9C)));
#define NVMCON2 NVMCON2
extern volatile uint32_t   NVMCON2 __attribute__((section("sfrs"), address(0xBF800AA0)));
typedef union {
  struct {
    uint32_t :6;
    uint32_t SWAPLOCK:2;
  };
  struct {
    uint32_t :8;
    uint32_t ERETRY:2;
    uint32_t :2;
    uint32_t VREAD1:1;
    uint32_t CREAD1:1;
    uint32_t :1;
    uint32_t LPRD:1;
    uint32_t LPRDWS:5;
    uint32_t :7;
    uint32_t ERSCNT:4;
  };
} __NVMCON2bits_t;
