Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
extern volatile __OFF094bits_t OFF094bits __asm__ ("OFF094") __attribute__((section("sfrs"), address(0xBF8106B8)));
#define OFF095 OFF095
extern volatile uint32_t   OFF095 __attribute__((section("sfrs"), address(0xBF8106BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF095bits_t;
extern volatile __OFF095bits_t OFF095bits __asm__ ("OFF095") __attribute__((section("sfrs"), address(0xBF8106BC)));
#define OFF096 OFF096
extern volatile uint32_t   OFF096 __attribute__((section("sfrs"), address(0xBF8106C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF096bits_t;
extern volatile __OFF096bits_t OFF096bits __asm__ ("OFF096") __attribute__((section("sfrs"), address(0xBF8106C0)));
#define OFF097 OFF097
extern volatile uint32_t   OFF097 __attribute__((section("sfrs"), address(0xBF8106C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF097bits_t;
extern volatile __OFF097bits_t OFF097bits __asm__ ("OFF097") __attribute__((section("sfrs"), address(0xBF8106C4)));
#define OFF098 OFF098
extern volatile uint32_t   OFF098 __attribute__((section("sfrs"), address(0xBF8106C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF098bits_t;
extern volatile __OFF098bits_t OFF098bits __asm__ ("OFF098") __attribute__((section("sfrs"), address(0xBF8106C8)));
#define OFF099 OFF099
extern volatile uint32_t   OFF099 __attribute__((section("sfrs"), address(0xBF8106CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF099bits_t;
extern volatile __OFF099bits_t OFF099bits __asm__ ("OFF099") __attribute__((section("sfrs"), address(0xBF8106CC)));
#define OFF100 OFF100
extern volatile uint32_t   OFF100 __attribute__((section("sfrs"), address(0xBF8106D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF100bits_t;
extern volatile __OFF100bits_t OFF100bits __asm__ ("OFF100") __attribute__((section("sfrs"), address(0xBF8106D0)));
#define OFF101 OFF101
extern volatile uint32_t   OFF101 __attribute__((section("sfrs"), address(0xBF8106D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF101bits_t;
extern volatile __OFF101bits_t OFF101bits __asm__ ("OFF101") __attribute__((section("sfrs"), address(0xBF8106D4)));
#define OFF102 OFF102
extern volatile uint32_t   OFF102 __attribute__((section("sfrs"), address(0xBF8106D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF102bits_t;
extern volatile __OFF102bits_t OFF102bits __asm__ ("OFF102") __attribute__((section("sfrs"), address(0xBF8106D8)));
#define OFF103 OFF103
extern volatile uint32_t   OFF103 __attribute__((section("sfrs"), address(0xBF8106DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF103bits_t;
extern volatile __OFF103bits_t OFF103bits __asm__ ("OFF103") __attribute__((section("sfrs"), address(0xBF8106DC)));
#define OFF104 OFF104
extern volatile uint32_t   OFF104 __attribute__((section("sfrs"), address(0xBF8106E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF104bits_t;
extern volatile __OFF104bits_t OFF104bits __asm__ ("OFF104") __attribute__((section("sfrs"), address(0xBF8106E0)));
#define OFF105 OFF105
extern volatile uint32_t   OFF105 __attribute__((section("sfrs"), address(0xBF8106E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF105bits_t;
extern volatile __OFF105bits_t OFF105bits __asm__ ("OFF105") __attribute__((section("sfrs"), address(0xBF8106E4)));
#define OFF106 OFF106
extern volatile uint32_t   OFF106 __attribute__((section("sfrs"), address(0xBF8106E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF106bits_t;
extern volatile __OFF106bits_t OFF106bits __asm__ ("OFF106") __attribute__((section("sfrs"), address(0xBF8106E8)));
#define OFF107 OFF107
extern volatile uint32_t   OFF107 __attribute__((section("sfrs"), address(0xBF8106EC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF107bits_t;
extern volatile __OFF107bits_t OFF107bits __asm__ ("OFF107") __attribute__((section("sfrs"), address(0xBF8106EC)));
#define OFF108 OFF108
extern volatile uint32_t   OFF108 __attribute__((section("sfrs"), address(0xBF8106F0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF108bits_t;
extern volatile __OFF108bits_t OFF108bits __asm__ ("OFF108") __attribute__((section("sfrs"), address(0xBF8106F0)));
#define OFF109 OFF109
extern volatile uint32_t   OFF109 __attribute__((section("sfrs"), address(0xBF8106F4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF109bits_t;
extern volatile __OFF109bits_t OFF109bits __asm__ ("OFF109") __attribute__((section("sfrs"), address(0xBF8106F4)));
#define OFF110 OFF110
extern volatile uint32_t   OFF110 __attribute__((section("sfrs"), address(0xBF8106F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF110bits_t;
extern volatile __OFF110bits_t OFF110bits __asm__ ("OFF110") __attribute__((section("sfrs"), address(0xBF8106F8)));
#define OFF111 OFF111
extern volatile uint32_t   OFF111 __attribute__((section("sfrs"), address(0xBF8106FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF111bits_t;
extern volatile __OFF111bits_t OFF111bits __asm__ ("OFF111") __attribute__((section("sfrs"), address(0xBF8106FC)));
#define OFF112 OFF112
extern volatile uint32_t   OFF112 __attribute__((section("sfrs"), address(0xBF810700)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF112bits_t;
extern volatile __OFF112bits_t OFF112bits __asm__ ("OFF112") __attribute__((section("sfrs"), address(0xBF810700)));
#define OFF113 OFF113
extern volatile uint32_t   OFF113 __attribute__((section("sfrs"), address(0xBF810704)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF113bits_t;
extern volatile __OFF113bits_t OFF113bits __asm__ ("OFF113") __attribute__((section("sfrs"), address(0xBF810704)));
#define OFF114 OFF114
extern volatile uint32_t   OFF114 __attribute__((section("sfrs"), address(0xBF810708)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF114bits_t;
extern volatile __OFF114bits_t OFF114bits __asm__ ("OFF114") __attribute__((section("sfrs"), address(0xBF810708)));
#define OFF115 OFF115
extern volatile uint32_t   OFF115 __attribute__((section("sfrs"), address(0xBF81070C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF115bits_t;
