Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
extern volatile __TRIG8bits_t TRIG8bits __asm__ ("TRIG8") __attribute__((section("sfrs"), address(0xBF82A840)));
extern volatile uint32_t        TRIG8CLR __attribute__((section("sfrs"),address(0xBF82A844)));
extern volatile uint32_t        TRIG8SET __attribute__((section("sfrs"),address(0xBF82A848)));
extern volatile uint32_t        TRIG8INV __attribute__((section("sfrs"),address(0xBF82A84C)));
#define TRGCON8 TRGCON8
extern volatile uint32_t   TRGCON8 __attribute__((section("sfrs"), address(0xBF82A850)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON8bits_t;
extern volatile __TRGCON8bits_t TRGCON8bits __asm__ ("TRGCON8") __attribute__((section("sfrs"), address(0xBF82A850)));
extern volatile uint32_t        TRGCON8CLR __attribute__((section("sfrs"),address(0xBF82A854)));
extern volatile uint32_t        TRGCON8SET __attribute__((section("sfrs"),address(0xBF82A858)));
extern volatile uint32_t        TRGCON8INV __attribute__((section("sfrs"),address(0xBF82A85C)));
#define STRIG8 STRIG8
extern volatile uint32_t   STRIG8 __attribute__((section("sfrs"), address(0xBF82A860)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG8bits_t;
extern volatile __STRIG8bits_t STRIG8bits __asm__ ("STRIG8") __attribute__((section("sfrs"), address(0xBF82A860)));
extern volatile uint32_t        STRIG8CLR __attribute__((section("sfrs"),address(0xBF82A864)));
extern volatile uint32_t        STRIG8SET __attribute__((section("sfrs"),address(0xBF82A868)));
extern volatile uint32_t        STRIG8INV __attribute__((section("sfrs"),address(0xBF82A86C)));
#define CAP8 CAP8
extern volatile uint32_t   CAP8 __attribute__((section("sfrs"), address(0xBF82A870)));
typedef struct {
  uint32_t CAP:16;
} __CAP8bits_t;
extern volatile __CAP8bits_t CAP8bits __asm__ ("CAP8") __attribute__((section("sfrs"), address(0xBF82A870)));
extern volatile uint32_t        CAP8CLR __attribute__((section("sfrs"),address(0xBF82A874)));
extern volatile uint32_t        CAP8SET __attribute__((section("sfrs"),address(0xBF82A878)));
extern volatile uint32_t        CAP8INV __attribute__((section("sfrs"),address(0xBF82A87C)));
#define LEBCON8 LEBCON8
extern volatile uint32_t   LEBCON8 __attribute__((section("sfrs"), address(0xBF82A880)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON8bits_t;
extern volatile __LEBCON8bits_t LEBCON8bits __asm__ ("LEBCON8") __attribute__((section("sfrs"), address(0xBF82A880)));
extern volatile uint32_t        LEBCON8CLR __attribute__((section("sfrs"),address(0xBF82A884)));
extern volatile uint32_t        LEBCON8SET __attribute__((section("sfrs"),address(0xBF82A888)));
extern volatile uint32_t        LEBCON8INV __attribute__((section("sfrs"),address(0xBF82A88C)));
#define LEBDLY8 LEBDLY8
extern volatile uint32_t   LEBDLY8 __attribute__((section("sfrs"), address(0xBF82A890)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY8bits_t;
extern volatile __LEBDLY8bits_t LEBDLY8bits __asm__ ("LEBDLY8") __attribute__((section("sfrs"), address(0xBF82A890)));
extern volatile uint32_t        LEBDLY8CLR __attribute__((section("sfrs"),address(0xBF82A894)));
extern volatile uint32_t        LEBDLY8SET __attribute__((section("sfrs"),address(0xBF82A898)));
extern volatile uint32_t        LEBDLY8INV __attribute__((section("sfrs"),address(0xBF82A89C)));
#define AUXCON8 AUXCON8
extern volatile uint32_t   AUXCON8 __attribute__((section("sfrs"), address(0xBF82A8A0)));
typedef struct {
  uint32_t CHOPLEN:1;
  uint32_t CHOPHEN:1;
  uint32_t CHOPSEL:4;
} __AUXCON8bits_t;
extern volatile __AUXCON8bits_t AUXCON8bits __asm__ ("AUXCON8") __attribute__((section("sfrs"), address(0xBF82A8A0)));
extern volatile uint32_t        AUXCON8CLR __attribute__((section("sfrs"),address(0xBF82A8A4)));
extern volatile uint32_t        AUXCON8SET __attribute__((section("sfrs"),address(0xBF82A8A8)));
extern volatile uint32_t        AUXCON8INV __attribute__((section("sfrs"),address(0xBF82A8AC)));
#define PTMR8 PTMR8
extern volatile uint32_t   PTMR8 __attribute__((section("sfrs"), address(0xBF82A8B0)));
typedef struct {
  uint32_t TMR:16;
} __PTMR8bits_t;
extern volatile __PTMR8bits_t PTMR8bits __asm__ ("PTMR8") __attribute__((section("sfrs"), address(0xBF82A8B0)));
extern volatile uint32_t        PTMR8CLR __attribute__((section("sfrs"),address(0xBF82A8B4)));
extern volatile uint32_t        PTMR8SET __attribute__((section("sfrs"),address(0xBF82A8B8)));
extern volatile uint32_t        PTMR8INV __attribute__((section("sfrs"),address(0xBF82A8BC)));
#define PWMCON9 PWMCON9
extern volatile uint32_t   PWMCON9 __attribute__((section("sfrs"), address(0xBF82A8C0)));
typedef struct {
  uint32_t :1;
  uint32_t XPRES:1;
  uint32_t :1;
  uint32_t MTBS:1;
  uint32_t PTDIR:1;
  uint32_t DTCP:1;
  uint32_t DTC:2;
  uint32_t :1;
  uint32_t ITB:1;
  uint32_t ECAM:2;
  uint32_t :2;
  uint32_t CLTSTAT:1;
  uint32_t FLTSTAT:1;
  uint32_t :3;
  uint32_t PWMHIEN:1;
  uint32_t PWMLIEN:1;
  uint32_t TRGIEN:1;
  uint32_t CLIEN:1;
  uint32_t FLTIEN:1;
  uint32_t :3;
  uint32_t PWMHIF:1;
  uint32_t PWMLIF:1;
  uint32_t TRGIF:1;
  uint32_t CLIF:1;
  uint32_t FLTIF:1;
} __PWMCON9bits_t;
extern volatile __PWMCON9bits_t PWMCON9bits __asm__ ("PWMCON9") __attribute__((section("sfrs"), address(0xBF82A8C0)));
extern volatile uint32_t        PWMCON9CLR __attribute__((section("sfrs"),address(0xBF82A8C4)));
extern volatile uint32_t        PWMCON9SET __attribute__((section("sfrs"),address(0xBF82A8C8)));
extern volatile uint32_t        PWMCON9INV __attribute__((section("sfrs"),address(0xBF82A8CC)));
#define IOCON9 IOCON9
extern volatile uint32_t   IOCON9 __attribute__((section("sfrs"), address(0xBF82A8D0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON9bits_t;
extern volatile __IOCON9bits_t IOCON9bits __asm__ ("IOCON9") __attribute__((section("sfrs"), address(0xBF82A8D0)));
extern volatile uint32_t        IOCON9CLR __attribute__((section("sfrs"),address(0xBF82A8D4)));
extern volatile uint32_t        IOCON9SET __attribute__((section("sfrs"),address(0xBF82A8D8)));
extern volatile uint32_t        IOCON9INV __attribute__((section("sfrs"),address(0xBF82A8DC)));
#define PDC9 PDC9
extern volatile uint32_t   PDC9 __attribute__((section("sfrs"), address(0xBF82A8E0)));
typedef struct {
  uint32_t PDC:16;
} __PDC9bits_t;
extern volatile __PDC9bits_t PDC9bits __asm__ ("PDC9") __attribute__((section("sfrs"), address(0xBF82A8E0)));
extern volatile uint32_t        PDC9CLR __attribute__((section("sfrs"),address(0xBF82A8E4)));
extern volatile uint32_t        PDC9SET __attribute__((section("sfrs"),address(0xBF82A8E8)));
extern volatile uint32_t        PDC9INV __attribute__((section("sfrs"),address(0xBF82A8EC)));
#define SDC9 SDC9
extern volatile uint32_t   SDC9 __attribute__((section("sfrs"), address(0xBF82A8F0)));
typedef struct {
  uint32_t SDC:16;
} __SDC9bits_t;
extern volatile __SDC9bits_t SDC9bits __asm__ ("SDC9") __attribute__((section("sfrs"), address(0xBF82A8F0)));
extern volatile uint32_t        SDC9CLR __attribute__((section("sfrs"),address(0xBF82A8F4)));
extern volatile uint32_t        SDC9SET __attribute__((section("sfrs"),address(0xBF82A8F8)));
extern volatile uint32_t        SDC9INV __attribute__((section("sfrs"),address(0xBF82A8FC)));
#define PHASE9 PHASE9
extern volatile uint32_t   PHASE9 __attribute__((section("sfrs"), address(0xBF82A900)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE9bits_t;
extern volatile __PHASE9bits_t PHASE9bits __asm__ ("PHASE9") __attribute__((section("sfrs"), address(0xBF82A900)));
extern volatile uint32_t        PHASE9CLR __attribute__((section("sfrs"),address(0xBF82A904)));
extern volatile uint32_t        PHASE9SET __attribute__((section("sfrs"),address(0xBF82A908)));
extern volatile uint32_t        PHASE9INV __attribute__((section("sfrs"),address(0xBF82A90C)));
#define DTR9 DTR9
extern volatile uint32_t   DTR9 __attribute__((section("sfrs"), address(0xBF82A910)));
typedef struct {
  uint32_t DTR:16;
} __DTR9bits_t;
extern volatile __DTR9bits_t DTR9bits __asm__ ("DTR9") __attribute__((section("sfrs"), address(0xBF82A910)));
extern volatile uint32_t        DTR9CLR __attribute__((section("sfrs"),address(0xBF82A914)));
extern volatile uint32_t        DTR9SET __attribute__((section("sfrs"),address(0xBF82A918)));
extern volatile uint32_t        DTR9INV __attribute__((section("sfrs"),address(0xBF82A91C)));
#define ALTDTR9 ALTDTR9
extern volatile uint32_t   ALTDTR9 __attribute__((section("sfrs"), address(0xBF82A920)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR9bits_t;
extern volatile __ALTDTR9bits_t ALTDTR9bits __asm__ ("ALTDTR9") __attribute__((section("sfrs"), address(0xBF82A920)));
extern volatile uint32_t        ALTDTR9CLR __attribute__((section("sfrs"),address(0xBF82A924)));
extern volatile uint32_t        ALTDTR9SET __attribute__((section("sfrs"),address(0xBF82A928)));
extern volatile uint32_t        ALTDTR9INV __attribute__((section("sfrs"),address(0xBF82A92C)));
#define DTCOMP9 DTCOMP9
extern volatile uint32_t   DTCOMP9 __attribute__((section("sfrs"), address(0xBF82A930)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP9bits_t;
extern volatile __DTCOMP9bits_t DTCOMP9bits __asm__ ("DTCOMP9") __attribute__((section("sfrs"), address(0xBF82A930)));
extern volatile uint32_t        DTCOMP9CLR __attribute__((section("sfrs"),address(0xBF82A934)));
extern volatile uint32_t        DTCOMP9SET __attribute__((section("sfrs"),address(0xBF82A938)));
extern volatile uint32_t        DTCOMP9INV __attribute__((section("sfrs"),address(0xBF82A93C)));
#define TRIG9 TRIG9
extern volatile uint32_t   TRIG9 __attribute__((section("sfrs"), address(0xBF82A940)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG9bits_t;
extern volatile __TRIG9bits_t TRIG9bits __asm__ ("TRIG9") __attribute__((section("sfrs"), address(0xBF82A940)));
extern volatile uint32_t        TRIG9CLR __attribute__((section("sfrs"),address(0xBF82A944)));
extern volatile uint32_t        TRIG9SET __attribute__((section("sfrs"),address(0xBF82A948)));
extern volatile uint32_t        TRIG9INV __attribute__((section("sfrs"),address(0xBF82A94C)));
#define TRGCON9 TRGCON9
extern volatile uint32_t   TRGCON9 __attribute__((section("sfrs"), address(0xBF82A950)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON9bits_t;
extern volatile __TRGCON9bits_t TRGCON9bits __asm__ ("TRGCON9") __attribute__((section("sfrs"), address(0xBF82A950)));
extern volatile uint32_t        TRGCON9CLR __attribute__((section("sfrs"),address(0xBF82A954)));
extern volatile uint32_t        TRGCON9SET __attribute__((section("sfrs"),address(0xBF82A958)));
extern volatile uint32_t        TRGCON9INV __attribute__((section("sfrs"),address(0xBF82A95C)));
#define STRIG9 STRIG9
extern volatile uint32_t   STRIG9 __attribute__((section("sfrs"), address(0xBF82A960)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG9bits_t;
extern volatile __STRIG9bits_t STRIG9bits __asm__ ("STRIG9") __attribute__((section("sfrs"), address(0xBF82A960)));
extern volatile uint32_t        STRIG9CLR __attribute__((section("sfrs"),address(0xBF82A964)));
extern volatile uint32_t        STRIG9SET __attribute__((section("sfrs"),address(0xBF82A968)));
extern volatile uint32_t        STRIG9INV __attribute__((section("sfrs"),address(0xBF82A96C)));
#define CAP9 CAP9
extern volatile uint32_t   CAP9 __attribute__((section("sfrs"), address(0xBF82A970)));
typedef struct {
  uint32_t CAP:16;
} __CAP9bits_t;
