Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
extern volatile __PWMCON12bits_t PWMCON12bits __asm__ ("PWMCON12") __attribute__((section("sfrs"), address(0xBF82ABC0)));
extern volatile uint32_t        PWMCON12CLR __attribute__((section("sfrs"),address(0xBF82ABC4)));
extern volatile uint32_t        PWMCON12SET __attribute__((section("sfrs"),address(0xBF82ABC8)));
extern volatile uint32_t        PWMCON12INV __attribute__((section("sfrs"),address(0xBF82ABCC)));
#define IOCON12 IOCON12
extern volatile uint32_t   IOCON12 __attribute__((section("sfrs"), address(0xBF82ABD0)));
typedef struct {
  uint32_t OSYNC:1;
  uint32_t SWAP:1;
  uint32_t CLDAT:2;
  uint32_t FLTDAT:2;
  uint32_t OVRDAT:2;
  uint32_t OVRENL:1;
  uint32_t OVRENH:1;
  uint32_t PMOD:2;
  uint32_t POLL:1;
  uint32_t POLH:1;
  uint32_t PENL:1;
  uint32_t PENH:1;
  uint32_t FLTMOD:2;
  uint32_t FLTPOL:1;
  uint32_t FLTSRC:4;
  uint32_t :1;
  uint32_t CLMOD:1;
  uint32_t CLPOL:1;
  uint32_t CLSRC:4;
} __IOCON12bits_t;
extern volatile __IOCON12bits_t IOCON12bits __asm__ ("IOCON12") __attribute__((section("sfrs"), address(0xBF82ABD0)));
extern volatile uint32_t        IOCON12CLR __attribute__((section("sfrs"),address(0xBF82ABD4)));
extern volatile uint32_t        IOCON12SET __attribute__((section("sfrs"),address(0xBF82ABD8)));
extern volatile uint32_t        IOCON12INV __attribute__((section("sfrs"),address(0xBF82ABDC)));
#define PDC12 PDC12
extern volatile uint32_t   PDC12 __attribute__((section("sfrs"), address(0xBF82ABE0)));
typedef struct {
  uint32_t PDC:16;
} __PDC12bits_t;
extern volatile __PDC12bits_t PDC12bits __asm__ ("PDC12") __attribute__((section("sfrs"), address(0xBF82ABE0)));
extern volatile uint32_t        PDC12CLR __attribute__((section("sfrs"),address(0xBF82ABE4)));
extern volatile uint32_t        PDC12SET __attribute__((section("sfrs"),address(0xBF82ABE8)));
extern volatile uint32_t        PDC12INV __attribute__((section("sfrs"),address(0xBF82ABEC)));
#define SDC12 SDC12
extern volatile uint32_t   SDC12 __attribute__((section("sfrs"), address(0xBF82ABF0)));
typedef struct {
  uint32_t SDC:16;
} __SDC12bits_t;
extern volatile __SDC12bits_t SDC12bits __asm__ ("SDC12") __attribute__((section("sfrs"), address(0xBF82ABF0)));
extern volatile uint32_t        SDC12CLR __attribute__((section("sfrs"),address(0xBF82ABF4)));
extern volatile uint32_t        SDC12SET __attribute__((section("sfrs"),address(0xBF82ABF8)));
extern volatile uint32_t        SDC12INV __attribute__((section("sfrs"),address(0xBF82ABFC)));
#define PHASE12 PHASE12
extern volatile uint32_t   PHASE12 __attribute__((section("sfrs"), address(0xBF82AC00)));
typedef struct {
  uint32_t PHASE:16;
} __PHASE12bits_t;
extern volatile __PHASE12bits_t PHASE12bits __asm__ ("PHASE12") __attribute__((section("sfrs"), address(0xBF82AC00)));
extern volatile uint32_t        PHASE12CLR __attribute__((section("sfrs"),address(0xBF82AC04)));
extern volatile uint32_t        PHASE12SET __attribute__((section("sfrs"),address(0xBF82AC08)));
extern volatile uint32_t        PHASE12INV __attribute__((section("sfrs"),address(0xBF82AC0C)));
#define DTR12 DTR12
extern volatile uint32_t   DTR12 __attribute__((section("sfrs"), address(0xBF82AC10)));
typedef struct {
  uint32_t DTR:16;
} __DTR12bits_t;
extern volatile __DTR12bits_t DTR12bits __asm__ ("DTR12") __attribute__((section("sfrs"), address(0xBF82AC10)));
extern volatile uint32_t        DTR12CLR __attribute__((section("sfrs"),address(0xBF82AC14)));
extern volatile uint32_t        DTR12SET __attribute__((section("sfrs"),address(0xBF82AC18)));
extern volatile uint32_t        DTR12INV __attribute__((section("sfrs"),address(0xBF82AC1C)));
#define ALTDTR12 ALTDTR12
extern volatile uint32_t   ALTDTR12 __attribute__((section("sfrs"), address(0xBF82AC20)));
typedef struct {
  uint32_t ALTDTR:16;
} __ALTDTR12bits_t;
extern volatile __ALTDTR12bits_t ALTDTR12bits __asm__ ("ALTDTR12") __attribute__((section("sfrs"), address(0xBF82AC20)));
extern volatile uint32_t        ALTDTR12CLR __attribute__((section("sfrs"),address(0xBF82AC24)));
extern volatile uint32_t        ALTDTR12SET __attribute__((section("sfrs"),address(0xBF82AC28)));
extern volatile uint32_t        ALTDTR12INV __attribute__((section("sfrs"),address(0xBF82AC2C)));
#define DTCOMP12 DTCOMP12
extern volatile uint32_t   DTCOMP12 __attribute__((section("sfrs"), address(0xBF82AC30)));
typedef struct {
  uint32_t COMP:14;
} __DTCOMP12bits_t;
extern volatile __DTCOMP12bits_t DTCOMP12bits __asm__ ("DTCOMP12") __attribute__((section("sfrs"), address(0xBF82AC30)));
extern volatile uint32_t        DTCOMP12CLR __attribute__((section("sfrs"),address(0xBF82AC34)));
extern volatile uint32_t        DTCOMP12SET __attribute__((section("sfrs"),address(0xBF82AC38)));
extern volatile uint32_t        DTCOMP12INV __attribute__((section("sfrs"),address(0xBF82AC3C)));
#define TRIG12 TRIG12
extern volatile uint32_t   TRIG12 __attribute__((section("sfrs"), address(0xBF82AC40)));
typedef struct {
  uint32_t TRGCMP:16;
} __TRIG12bits_t;
extern volatile __TRIG12bits_t TRIG12bits __asm__ ("TRIG12") __attribute__((section("sfrs"), address(0xBF82AC40)));
extern volatile uint32_t        TRIG12CLR __attribute__((section("sfrs"),address(0xBF82AC44)));
extern volatile uint32_t        TRIG12SET __attribute__((section("sfrs"),address(0xBF82AC48)));
extern volatile uint32_t        TRIG12INV __attribute__((section("sfrs"),address(0xBF82AC4C)));
#define TRGCON12 TRGCON12
extern volatile uint32_t   TRGCON12 __attribute__((section("sfrs"), address(0xBF82AC50)));
typedef struct {
  uint32_t :6;
  uint32_t STRGIS:1;
  uint32_t DTM:1;
  uint32_t STRGSEL:2;
  uint32_t TRGSEL:2;
  uint32_t TRGDIV:4;
} __TRGCON12bits_t;
extern volatile __TRGCON12bits_t TRGCON12bits __asm__ ("TRGCON12") __attribute__((section("sfrs"), address(0xBF82AC50)));
extern volatile uint32_t        TRGCON12CLR __attribute__((section("sfrs"),address(0xBF82AC54)));
extern volatile uint32_t        TRGCON12SET __attribute__((section("sfrs"),address(0xBF82AC58)));
extern volatile uint32_t        TRGCON12INV __attribute__((section("sfrs"),address(0xBF82AC5C)));
#define STRIG12 STRIG12
extern volatile uint32_t   STRIG12 __attribute__((section("sfrs"), address(0xBF82AC60)));
typedef struct {
  uint32_t STRGCMP:16;
} __STRIG12bits_t;
extern volatile __STRIG12bits_t STRIG12bits __asm__ ("STRIG12") __attribute__((section("sfrs"), address(0xBF82AC60)));
extern volatile uint32_t        STRIG12CLR __attribute__((section("sfrs"),address(0xBF82AC64)));
extern volatile uint32_t        STRIG12SET __attribute__((section("sfrs"),address(0xBF82AC68)));
extern volatile uint32_t        STRIG12INV __attribute__((section("sfrs"),address(0xBF82AC6C)));
#define CAP12 CAP12
extern volatile uint32_t   CAP12 __attribute__((section("sfrs"), address(0xBF82AC70)));
typedef struct {
  uint32_t CAP:16;
} __CAP12bits_t;
extern volatile __CAP12bits_t CAP12bits __asm__ ("CAP12") __attribute__((section("sfrs"), address(0xBF82AC70)));
extern volatile uint32_t        CAP12CLR __attribute__((section("sfrs"),address(0xBF82AC74)));
extern volatile uint32_t        CAP12SET __attribute__((section("sfrs"),address(0xBF82AC78)));
extern volatile uint32_t        CAP12INV __attribute__((section("sfrs"),address(0xBF82AC7C)));
#define LEBCON12 LEBCON12
extern volatile uint32_t   LEBCON12 __attribute__((section("sfrs"), address(0xBF82AC80)));
typedef struct {
  uint32_t :10;
  uint32_t CLLEBEN:1;
  uint32_t FLTLEBEN:1;
  uint32_t PLF:1;
  uint32_t PLR:1;
  uint32_t PHF:1;
  uint32_t PHR:1;
} __LEBCON12bits_t;
extern volatile __LEBCON12bits_t LEBCON12bits __asm__ ("LEBCON12") __attribute__((section("sfrs"), address(0xBF82AC80)));
extern volatile uint32_t        LEBCON12CLR __attribute__((section("sfrs"),address(0xBF82AC84)));
extern volatile uint32_t        LEBCON12SET __attribute__((section("sfrs"),address(0xBF82AC88)));
extern volatile uint32_t        LEBCON12INV __attribute__((section("sfrs"),address(0xBF82AC8C)));
#define LEBDLY12 LEBDLY12
extern volatile uint32_t   LEBDLY12 __attribute__((section("sfrs"), address(0xBF82AC90)));
typedef struct {
  uint32_t LEB:12;
} __LEBDLY12bits_t;
