Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
  .extern ADCDSTAT2CLR     /* 0xBF8870D4 */
  .extern ADCDSTAT2SET     /* 0xBF8870D8 */
  .extern ADCDSTAT2INV     /* 0xBF8870DC */
  .extern ADCCMPEN1        /* 0xBF8870E0 */
  .extern ADCCMPEN1CLR     /* 0xBF8870E4 */
  .extern ADCCMPEN1SET     /* 0xBF8870E8 */
  .extern ADCCMPEN1INV     /* 0xBF8870EC */
  .extern ADCCMP1          /* 0xBF8870F0 */
  .extern ADCCMP1CLR       /* 0xBF8870F4 */
  .extern ADCCMP1SET       /* 0xBF8870F8 */
  .extern ADCCMP1INV       /* 0xBF8870FC */
  .extern ADCCMPEN2        /* 0xBF887100 */
  .extern ADCCMPEN2CLR     /* 0xBF887104 */
  .extern ADCCMPEN2SET     /* 0xBF887108 */
  .extern ADCCMPEN2INV     /* 0xBF88710C */
  .extern ADCCMP2          /* 0xBF887110 */
  .extern ADCCMP2CLR       /* 0xBF887114 */
  .extern ADCCMP2SET       /* 0xBF887118 */
  .extern ADCCMP2INV       /* 0xBF88711C */
  .extern ADCCMPEN3        /* 0xBF887120 */
  .extern ADCCMPEN3CLR     /* 0xBF887124 */
  .extern ADCCMPEN3SET     /* 0xBF887128 */
  .extern ADCCMPEN3INV     /* 0xBF88712C */
  .extern ADCCMP3          /* 0xBF887130 */
  .extern ADCCMP3CLR       /* 0xBF887134 */
  .extern ADCCMP3SET       /* 0xBF887138 */
  .extern ADCCMP3INV       /* 0xBF88713C */
  .extern ADCCMPEN4        /* 0xBF887140 */
  .extern ADCCMPEN4CLR     /* 0xBF887144 */
  .extern ADCCMPEN4SET     /* 0xBF887148 */
  .extern ADCCMPEN4INV     /* 0xBF88714C */
  .extern ADCCMP4          /* 0xBF887150 */
  .extern ADCCMP4CLR       /* 0xBF887154 */
  .extern ADCCMP4SET       /* 0xBF887158 */
  .extern ADCCMP4INV       /* 0xBF88715C */
  .extern ADCFLTR1         /* 0xBF8871A0 */
  .extern ADCFLTR1CLR      /* 0xBF8871A4 */
  .extern ADCFLTR1SET      /* 0xBF8871A8 */
  .extern ADCFLTR1INV      /* 0xBF8871AC */
  .extern ADCFLTR2         /* 0xBF8871B0 */
  .extern ADCFLTR2CLR      /* 0xBF8871B4 */
  .extern ADCFLTR2SET      /* 0xBF8871B8 */
  .extern ADCFLTR2INV      /* 0xBF8871BC */
  .extern ADCFLTR3         /* 0xBF8871C0 */
  .extern ADCFLTR3CLR      /* 0xBF8871C4 */
  .extern ADCFLTR3SET      /* 0xBF8871C8 */
  .extern ADCFLTR3INV      /* 0xBF8871CC */
  .extern ADCFLTR4         /* 0xBF8871D0 */
  .extern ADCFLTR4CLR      /* 0xBF8871D4 */
  .extern ADCFLTR4SET      /* 0xBF8871D8 */
  .extern ADCFLTR4INV      /* 0xBF8871DC */
  .extern ADCTRG1          /* 0xBF887200 */
  .extern ADCTRG1CLR       /* 0xBF887204 */
  .extern ADCTRG1SET       /* 0xBF887208 */
  .extern ADCTRG1INV       /* 0xBF88720C */
  .extern ADCTRG2          /* 0xBF887210 */
  .extern ADCTRG2CLR       /* 0xBF887214 */
  .extern ADCTRG2SET       /* 0xBF887218 */
  .extern ADCTRG2INV       /* 0xBF88721C */
  .extern ADCTRG3          /* 0xBF887220 */
  .extern ADCTRG3CLR       /* 0xBF887224 */
  .extern ADCTRG3SET       /* 0xBF887228 */
  .extern ADCTRG3INV       /* 0xBF88722C */
  .extern ADCTRG4          /* 0xBF887230 */
  .extern ADCTRG4CLR       /* 0xBF887234 */
  .extern ADCTRG4SET       /* 0xBF887238 */
  .extern ADCTRG4INV       /* 0xBF88723C */
  .extern ADCTRG5          /* 0xBF887240 */
  .extern ADCTRG5CLR       /* 0xBF887244 */
  .extern ADCTRG5SET       /* 0xBF887248 */
  .extern ADCTRG5INV       /* 0xBF88724C */
  .extern ADCTRG6          /* 0xBF887250 */
  .extern ADCTRG6CLR       /* 0xBF887254 */
  .extern ADCTRG6SET       /* 0xBF887258 */
  .extern ADCTRG6INV       /* 0xBF88725C */
  .extern ADCTRG7          /* 0xBF887260 */
  .extern ADCTRG7CLR       /* 0xBF887264 */
  .extern ADCTRG7SET       /* 0xBF887268 */
  .extern ADCTRG7INV       /* 0xBF88726C */
  .extern ADCCMPCON1       /* 0xBF887280 */
  .extern ADCCMPCON1CLR    /* 0xBF887284 */
  .extern ADCCMPCON1SET    /* 0xBF887288 */
  .extern ADCCMPCON1INV    /* 0xBF88728C */
  .extern ADCCMPCON2       /* 0xBF887290 */
  .extern ADCCMPCON2CLR    /* 0xBF887294 */
  .extern ADCCMPCON2SET    /* 0xBF887298 */
  .extern ADCCMPCON2INV    /* 0xBF88729C */
  .extern ADCCMPCON3       /* 0xBF8872A0 */
  .extern ADCCMPCON3CLR    /* 0xBF8872A4 */
  .extern ADCCMPCON3SET    /* 0xBF8872A8 */
  .extern ADCCMPCON3INV    /* 0xBF8872AC */
  .extern ADCCMPCON4       /* 0xBF8872B0 */
  .extern ADCCMPCON4CLR    /* 0xBF8872B4 */
  .extern ADCCMPCON4SET    /* 0xBF8872B8 */
  .extern ADCCMPCON4INV    /* 0xBF8872BC */
  .extern ADCBASE          /* 0xBF887300 */
  .extern ADCBASECLR       /* 0xBF887304 */
  .extern ADCBASESET       /* 0xBF887308 */
  .extern ADCBASEINV       /* 0xBF88730C */
  .extern ADCDSTAT         /* 0xBF887310 */
  .extern ADCDSTATCLR      /* 0xBF887314 */
  .extern ADCDSTATSET      /* 0xBF887318 */
  .extern ADCDSTATINV      /* 0xBF88731C */
  .extern ADCCNTB          /* 0xBF887320 */
  .extern ADCCNTBCLR       /* 0xBF887324 */
  .extern ADCCNTBSET       /* 0xBF887328 */
  .extern ADCCNTBINV       /* 0xBF88732C */
  .extern ADCDMAB          /* 0xBF887330 */
  .extern ADCDMABCLR       /* 0xBF887334 */
  .extern ADCDMABSET       /* 0xBF887338 */
  .extern ADCDMABINV       /* 0xBF88733C */
  .extern ADCTRGSNS        /* 0xBF887340 */
  .extern ADCTRGSNSCLR     /* 0xBF887344 */
  .extern ADCTRGSNSSET     /* 0xBF887348 */
  .extern ADCTRGSNSINV     /* 0xBF88734C */
  .extern ADC0TIME         /* 0xBF887350 */
  .extern ADC0TIMECLR      /* 0xBF887354 */
  .extern ADC0TIMESET      /* 0xBF887358 */
  .extern ADC0TIMEINV      /* 0xBF88735C */
  .extern ADC1TIME         /* 0xBF887360 */
  .extern ADC1TIMECLR      /* 0xBF887364 */
  .extern ADC1TIMESET      /* 0xBF887368 */
  .extern ADC1TIMEINV      /* 0xBF88736C */
  .extern ADC2TIME         /* 0xBF887370 */
  .extern ADC2TIMECLR      /* 0xBF887374 */
  .extern ADC2TIMESET      /* 0xBF887378 */
  .extern ADC2TIMEINV      /* 0xBF88737C */
  .extern ADC3TIME         /* 0xBF887380 */
  .extern ADC3TIMECLR      /* 0xBF887384 */
  .extern ADC3TIMESET      /* 0xBF887388 */
  .extern ADC3TIMEINV      /* 0xBF88738C */
  .extern ADC4TIME         /* 0xBF887390 */
  .extern ADC4TIMECLR      /* 0xBF887394 */
  .extern ADC4TIMESET      /* 0xBF887398 */
  .extern ADC4TIMEINV      /* 0xBF88739C */
  .extern ADC5TIME         /* 0xBF8873A0 */
  .extern ADC5TIMECLR      /* 0xBF8873A4 */
  .extern ADC5TIMESET      /* 0xBF8873A8 */
  .extern ADC5TIMEINV      /* 0xBF8873AC */
  .extern ADCEIEN1         /* 0xBF8873C0 */
  .extern ADCEIEN1CLR      /* 0xBF8873C4 */
  .extern ADCEIEN1SET      /* 0xBF8873C8 */
  .extern ADCEIEN1INV      /* 0xBF8873CC */
  .extern ADCEIEN2         /* 0xBF8873D0 */
  .extern ADCEIEN2CLR      /* 0xBF8873D4 */
  .extern ADCEIEN2SET      /* 0xBF8873D8 */
  .extern ADCEIEN2INV      /* 0xBF8873DC */
  .extern ADCEISTAT1       /* 0xBF8873E0 */
  .extern ADCEISTAT1CLR    /* 0xBF8873E4 */
  .extern ADCEISTAT1SET    /* 0xBF8873E8 */
  .extern ADCEISTAT1INV    /* 0xBF8873EC */
  .extern ADCEISTAT2       /* 0xBF8873F0 */
  .extern ADCEISTAT2CLR    /* 0xBF8873F4 */
  .extern ADCEISTAT2SET    /* 0xBF8873F8 */
  .extern ADCEISTAT2INV    /* 0xBF8873FC */
  .extern ADCANCON         /* 0xBF887400 */
  .extern ADCANCONCLR      /* 0xBF887404 */
  .extern ADCANCONSET      /* 0xBF887408 */
  .extern ADCANCONINV      /* 0xBF88740C */
  .extern ADCDATA0         /* 0xBF887600 */
  .extern ADCDATA0CLR      /* 0xBF887604 */
  .extern ADCDATA0SET      /* 0xBF887608 */
  .extern ADCDATA0INV      /* 0xBF88760C */
  .extern ADCDATA1         /* 0xBF887610 */
  .extern ADCDATA1CLR      /* 0xBF887614 */
  .extern ADCDATA1SET      /* 0xBF887618 */
  .extern ADCDATA1INV      /* 0xBF88761C */
  .extern ADCDATA2         /* 0xBF887620 */
  .extern ADCDATA2CLR      /* 0xBF887624 */
  .extern ADCDATA2SET      /* 0xBF887628 */
  .extern ADCDATA2INV      /* 0xBF88762C */
  .extern ADCDATA3         /* 0xBF887630 */
  .extern ADCDATA3CLR      /* 0xBF887634 */
  .extern ADCDATA3SET      /* 0xBF887638 */
  .extern ADCDATA3INV      /* 0xBF88763C */
  .extern ADCDATA4         /* 0xBF887640 */
  .extern ADCDATA4CLR      /* 0xBF887644 */
  .extern ADCDATA4SET      /* 0xBF887648 */
  .extern ADCDATA4INV      /* 0xBF88764C */
  .extern ADCDATA5         /* 0xBF887650 */
  .extern ADCDATA5CLR      /* 0xBF887654 */
  .extern ADCDATA5SET      /* 0xBF887658 */
  .extern ADCDATA5INV      /* 0xBF88765C */
  .extern ADCDATA6         /* 0xBF887660 */
  .extern ADCDATA6CLR      /* 0xBF887664 */
  .extern ADCDATA6SET      /* 0xBF887668 */
  .extern ADCDATA6INV      /* 0xBF88766C */
  .extern ADCDATA7         /* 0xBF887670 */
  .extern ADCDATA7CLR      /* 0xBF887674 */
  .extern ADCDATA7SET      /* 0xBF887678 */
  .extern ADCDATA7INV      /* 0xBF88767C */
  .extern ADCDATA8         /* 0xBF887680 */
  .extern ADCDATA8CLR      /* 0xBF887684 */
  .extern ADCDATA8SET      /* 0xBF887688 */
  .extern ADCDATA8INV      /* 0xBF88768C */
  .extern ADCDATA9         /* 0xBF887690 */
  .extern ADCDATA9CLR      /* 0xBF887694 */
  .extern ADCDATA9SET      /* 0xBF887698 */
  .extern ADCDATA9INV      /* 0xBF88769C */
  .extern ADCDATA10        /* 0xBF8876A0 */
  .extern ADCDATA10CLR     /* 0xBF8876A4 */
  .extern ADCDATA10SET     /* 0xBF8876A8 */
  .extern ADCDATA10INV     /* 0xBF8876AC */
  .extern ADCDATA11        /* 0xBF8876B0 */
  .extern ADCDATA11CLR     /* 0xBF8876B4 */
  .extern ADCDATA11SET     /* 0xBF8876B8 */
  .extern ADCDATA11INV     /* 0xBF8876BC */
  .extern ADCDATA12        /* 0xBF8876C0 */
  .extern ADCDATA12CLR     /* 0xBF8876C4 */
  .extern ADCDATA12SET     /* 0xBF8876C8 */
  .extern ADCDATA12INV     /* 0xBF8876CC */
  .extern ADCDATA13        /* 0xBF8876D0 */
  .extern ADCDATA13CLR     /* 0xBF8876D4 */
  .extern ADCDATA13SET     /* 0xBF8876D8 */
  .extern ADCDATA13INV     /* 0xBF8876DC */
  .extern ADCDATA14        /* 0xBF8876E0 */
  .extern ADCDATA14CLR     /* 0xBF8876E4 */
  .extern ADCDATA14SET     /* 0xBF8876E8 */
  .extern ADCDATA14INV     /* 0xBF8876EC */
  .extern ADCDATA15        /* 0xBF8876F0 */
  .extern ADCDATA15CLR     /* 0xBF8876F4 */
  .extern ADCDATA15SET     /* 0xBF8876F8 */
  .extern ADCDATA15INV     /* 0xBF8876FC */
  .extern ADCDATA16        /* 0xBF887700 */
  .extern ADCDATA16CLR     /* 0xBF887704 */
  .extern ADCDATA16SET     /* 0xBF887708 */
  .extern ADCDATA16INV     /* 0xBF88770C */
  .extern ADCDATA17        /* 0xBF887710 */
  .extern ADCDATA17CLR     /* 0xBF887714 */
  .extern ADCDATA17SET     /* 0xBF887718 */
  .extern ADCDATA17INV     /* 0xBF88771C */
  .extern ADCDATA18        /* 0xBF887720 */
  .extern ADCDATA18CLR     /* 0xBF887724 */
  .extern ADCDATA18SET     /* 0xBF887728 */
  .extern ADCDATA18INV     /* 0xBF88772C */
  .extern ADCDATA19        /* 0xBF887730 */
  .extern ADCDATA19CLR     /* 0xBF887734 */
  .extern ADCDATA19SET     /* 0xBF887738 */
  .extern ADCDATA19INV     /* 0xBF88773C */
  .extern ADCDATA20        /* 0xBF887740 */
  .extern ADCDATA20CLR     /* 0xBF887744 */
  .extern ADCDATA20SET     /* 0xBF887748 */
  .extern ADCDATA20INV     /* 0xBF88774C */
  .extern ADCDATA21        /* 0xBF887750 */
  .extern ADCDATA21CLR     /* 0xBF887754 */
  .extern ADCDATA21SET     /* 0xBF887758 */
  .extern ADCDATA21INV     /* 0xBF88775C */
  .extern ADCDATA22        /* 0xBF887760 */
  .extern ADCDATA22CLR     /* 0xBF887764 */
  .extern ADCDATA22SET     /* 0xBF887768 */
  .extern ADCDATA22INV     /* 0xBF88776C */
  .extern ADCDATA23        /* 0xBF887770 */
  .extern ADCDATA23CLR     /* 0xBF887774 */
  .extern ADCDATA23SET     /* 0xBF887778 */
  .extern ADCDATA23INV     /* 0xBF88777C */
  .extern ADCDATA24        /* 0xBF887780 */
  .extern ADCDATA24CLR     /* 0xBF887784 */
  .extern ADCDATA24SET     /* 0xBF887788 */
  .extern ADCDATA24INV     /* 0xBF88778C */
  .extern ADCDATA25        /* 0xBF887790 */
  .extern ADCDATA25CLR     /* 0xBF887794 */
  .extern ADCDATA25SET     /* 0xBF887798 */
  .extern ADCDATA25INV     /* 0xBF88779C */
  .extern ADCDATA26        /* 0xBF8877A0 */
  .extern ADCDATA26CLR     /* 0xBF8877A4 */
  .extern ADCDATA26SET     /* 0xBF8877A8 */
  .extern ADCDATA26INV     /* 0xBF8877AC */
  .extern ADCDATA27        /* 0xBF8877B0 */
  .extern ADCDATA27CLR     /* 0xBF8877B4 */
  .extern ADCDATA27SET     /* 0xBF8877B8 */
  .extern ADCDATA27INV     /* 0xBF8877BC */
  .extern ADCDATA33        /* 0xBF887810 */
  .extern ADCDATA33CLR     /* 0xBF887814 */
  .extern ADCDATA33SET     /* 0xBF887818 */
  .extern ADCDATA33INV     /* 0xBF88781C */
  .extern ADCDATA34        /* 0xBF887820 */
  .extern ADCDATA34CLR     /* 0xBF887824 */
  .extern ADCDATA34SET     /* 0xBF887828 */
  .extern ADCDATA34INV     /* 0xBF88782C */
  .extern ADCDATA35        /* 0xBF887830 */
  .extern ADCDATA35CLR     /* 0xBF887834 */
  .extern ADCDATA35SET     /* 0xBF887838 */
  .extern ADCDATA35INV     /* 0xBF88783C */
  .extern ADCDATA36        /* 0xBF887840 */
  .extern ADCDATA36CLR     /* 0xBF887844 */
  .extern ADCDATA36SET     /* 0xBF887848 */
  .extern ADCDATA36INV     /* 0xBF88784C */
  .extern ADCDATA37        /* 0xBF887850 */
  .extern ADCDATA37CLR     /* 0xBF887854 */
  .extern ADCDATA37SET     /* 0xBF887858 */
  .extern ADCDATA37INV     /* 0xBF88785C */
  .extern ADCDATA38        /* 0xBF887860 */
  .extern ADCDATA38CLR     /* 0xBF887864 */
  .extern ADCDATA38SET     /* 0xBF887868 */
  .extern ADCDATA38INV     /* 0xBF88786C */
  .extern ADCDATA39        /* 0xBF887870 */
  .extern ADCDATA39CLR     /* 0xBF887874 */
  .extern ADCDATA39SET     /* 0xBF887878 */
  .extern ADCDATA39INV     /* 0xBF88787C */
  .extern ADCDATA40        /* 0xBF887880 */
  .extern ADCDATA40CLR     /* 0xBF887884 */
  .extern ADCDATA40SET     /* 0xBF887888 */
  .extern ADCDATA40INV     /* 0xBF88788C */
  .extern ADCDATA41        /* 0xBF887890 */
  .extern ADCDATA41CLR     /* 0xBF887894 */
  .extern ADCDATA41SET     /* 0xBF887898 */
  .extern ADCDATA41INV     /* 0xBF88789C */
  .extern ADCDATA45        /* 0xBF8878D0 */
  .extern ADCDATA45CLR     /* 0xBF8878D4 */
  .extern ADCDATA45SET     /* 0xBF8878D8 */
  .extern ADCDATA45INV     /* 0xBF8878DC */
  .extern ADCDATA46        /* 0xBF8878E0 */
  .extern ADCDATA46CLR     /* 0xBF8878E4 */
  .extern ADCDATA46SET     /* 0xBF8878E8 */
  .extern ADCDATA46INV     /* 0xBF8878EC */
  .extern ADCDATA47        /* 0xBF8878F0 */
  .extern ADCDATA47CLR     /* 0xBF8878F4 */
  .extern ADCDATA47SET     /* 0xBF8878F8 */
  .extern ADCDATA47INV     /* 0xBF8878FC */
  .extern ADCDATA48        /* 0xBF887900 */
  .extern ADCDATA48CLR     /* 0xBF887904 */
  .extern ADCDATA48SET     /* 0xBF887908 */
  .extern ADCDATA48INV     /* 0xBF88790C */
  .extern ADCDATA49        /* 0xBF887910 */
  .extern ADCDATA49CLR     /* 0xBF887914 */
  .extern ADCDATA49SET     /* 0xBF887918 */
  .extern ADCDATA49INV     /* 0xBF88791C */
  .extern ADCDATA50        /* 0xBF887920 */
  .extern ADCDATA50CLR     /* 0xBF887924 */
  .extern ADCDATA50SET     /* 0xBF887928 */
  .extern ADCDATA50INV     /* 0xBF88792C */
  .extern ADCDATA51        /* 0xBF887930 */
  .extern ADCDATA51CLR     /* 0xBF887934 */
  .extern ADCDATA51SET     /* 0xBF887938 */
  .extern ADCDATA51INV     /* 0xBF88793C */
  .extern ADCDATA52        /* 0xBF887940 */
  .extern ADCDATA52CLR     /* 0xBF887944 */
  .extern ADCDATA52SET     /* 0xBF887948 */
  .extern ADCDATA52INV     /* 0xBF88794C */
  .extern ADCDATA53        /* 0xBF887950 */
  .extern ADCDATA53CLR     /* 0xBF887954 */
  .extern ADCDATA53SET     /* 0xBF887958 */
  .extern ADCDATA53INV     /* 0xBF88795C */
  .extern ADC0CFG          /* 0xBF887D00 */
  .extern ADC0CFGCLR       /* 0xBF887D04 */
  .extern ADC0CFGSET       /* 0xBF887D08 */
  .extern ADC0CFGINV       /* 0xBF887D0C */
  .extern ADC1CFG          /* 0xBF887D10 */
  .extern ADC1CFGCLR       /* 0xBF887D14 */
  .extern ADC1CFGSET       /* 0xBF887D18 */
  .extern ADC1CFGINV       /* 0xBF887D1C */
  .extern ADC2CFG          /* 0xBF887D20 */
  .extern ADC2CFGCLR       /* 0xBF887D24 */
  .extern ADC2CFGSET       /* 0xBF887D28 */
  .extern ADC2CFGINV       /* 0xBF887D2C */
  .extern ADC3CFG          /* 0xBF887D30 */
  .extern ADC3CFGCLR       /* 0xBF887D34 */
  .extern ADC3CFGSET       /* 0xBF887D38 */
  .extern ADC3CFGINV       /* 0xBF887D3C */
  .extern ADC4CFG          /* 0xBF887D40 */
  .extern ADC4CFGCLR       /* 0xBF887D44 */
  .extern ADC4CFGSET       /* 0xBF887D48 */
  .extern ADC4CFGINV       /* 0xBF887D4C */
  .extern ADC5CFG          /* 0xBF887D50 */
  .extern ADC5CFGCLR       /* 0xBF887D54 */
  .extern ADC5CFGSET       /* 0xBF887D58 */
  .extern ADC5CFGINV       /* 0xBF887D5C */
  .extern ADC7CFG          /* 0xBF887D70 */
  .extern ADC7CFGCLR       /* 0xBF887D74 */
  .extern ADC7CFGSET       /* 0xBF887D78 */
  .extern ADC7CFGINV       /* 0xBF887D7C */
  .extern ADCSYSCFG0       /* 0xBF887E00 */
  .extern ADCSYSCFG0CLR    /* 0xBF887E04 */
  .extern ADCSYSCFG0SET    /* 0xBF887E08 */
  .extern ADCSYSCFG0INV    /* 0xBF887E0C */
  .extern ADCSYSCFG1       /* 0xBF887E10 */
  .extern ADCSYSCFG1CLR    /* 0xBF887E14 */
  .extern ADCSYSCFG1SET    /* 0xBF887E18 */
  .extern ADCSYSCFG1INV    /* 0xBF887E1C */
  .extern U1OTGIR          /* 0xBF889040 */
  .extern U1OTGIRCLR       /* 0xBF889044 */
  .extern U1OTGIE          /* 0xBF889050 */
  .extern U1OTGIECLR       /* 0xBF889054 */
  .extern U1OTGIESET       /* 0xBF889058 */
  .extern U1OTGIEINV       /* 0xBF88905C */
  .extern U1OTGSTAT        /* 0xBF889060 */
  .extern U1OTGCON         /* 0xBF889070 */
  .extern U1OTGCONCLR      /* 0xBF889074 */
  .extern U1OTGCONSET      /* 0xBF889078 */
  .extern U1OTGCONINV      /* 0xBF88907C */
  .extern U1PWRC           /* 0xBF889080 */
  .extern U1PWRCCLR        /* 0xBF889084 */
  .extern U1PWRCSET        /* 0xBF889088 */
  .extern U1PWRCINV        /* 0xBF88908C */
  .extern U1IR             /* 0xBF889200 */
  .extern U1IRCLR          /* 0xBF889204 */
  .extern U1IE             /* 0xBF889210 */
  .extern U1IECLR          /* 0xBF889214 */
  .extern U1IESET          /* 0xBF889218 */
  .extern U1IEINV          /* 0xBF88921C */
  .extern U1EIR            /* 0xBF889220 */
  .extern U1EIRCLR         /* 0xBF889224 */
  .extern U1EIE            /* 0xBF889230 */
  .extern U1EIECLR         /* 0xBF889234 */
  .extern U1EIESET         /* 0xBF889238 */
  .extern U1EIEINV         /* 0xBF88923C */
  .extern U1STAT           /* 0xBF889240 */
  .extern U1CON            /* 0xBF889250 */
  .extern U1CONCLR         /* 0xBF889254 */
  .extern U1CONSET         /* 0xBF889258 */
  .extern U1CONINV         /* 0xBF88925C */
  .extern U1ADDR           /* 0xBF889260 */
  .extern U1ADDRCLR        /* 0xBF889264 */
  .extern U1ADDRSET        /* 0xBF889268 */
  .extern U1ADDRINV        /* 0xBF88926C */
  .extern U1BDTP1          /* 0xBF889270 */
  .extern U1BDTP1CLR       /* 0xBF889274 */
  .extern U1BDTP1SET       /* 0xBF889278 */
  .extern U1BDTP1INV       /* 0xBF88927C */
  .extern U1FRML           /* 0xBF889280 */
  .extern U1FRMH           /* 0xBF889290 */
  .extern U1TOK            /* 0xBF8892A0 */
  .extern U1TOKCLR         /* 0xBF8892A4 */
  .extern U1TOKSET         /* 0xBF8892A8 */
  .extern U1TOKINV         /* 0xBF8892AC */
  .extern U1SOF            /* 0xBF8892B0 */
  .extern U1SOFCLR         /* 0xBF8892B4 */
  .extern U1SOFSET         /* 0xBF8892B8 */
  .extern U1SOFINV         /* 0xBF8892BC */
  .extern U1BDTP2          /* 0xBF8892C0 */
  .extern U1BDTP2CLR       /* 0xBF8892C4 */
  .extern U1BDTP2SET       /* 0xBF8892C8 */
  .extern U1BDTP2INV       /* 0xBF8892CC */
  .extern U1BDTP3          /* 0xBF8892D0 */
  .extern U1BDTP3CLR       /* 0xBF8892D4 */
  .extern U1BDTP3SET       /* 0xBF8892D8 */
  .extern U1BDTP3INV       /* 0xBF8892DC */
  .extern U1CNFG1          /* 0xBF8892E0 */
  .extern U1CNFG1CLR       /* 0xBF8892E4 */
  .extern U1CNFG1SET       /* 0xBF8892E8 */
  .extern U1CNFG1INV       /* 0xBF8892EC */
  .extern U1EP0            /* 0xBF889300 */
  .extern U1EP0CLR         /* 0xBF889304 */
  .extern U1EP0SET         /* 0xBF889308 */
  .extern U1EP0INV         /* 0xBF88930C */
  .extern U1EP1            /* 0xBF889310 */
  .extern U1EP1CLR         /* 0xBF889314 */
  .extern U1EP1SET         /* 0xBF889318 */
  .extern U1EP1INV         /* 0xBF88931C */
  .extern U1EP2            /* 0xBF889320 */
  .extern U1EP2CLR         /* 0xBF889324 */
  .extern U1EP2SET         /* 0xBF889328 */
  .extern U1EP2INV         /* 0xBF88932C */
  .extern U1EP3            /* 0xBF889330 */
  .extern U1EP3CLR         /* 0xBF889334 */
  .extern U1EP3SET         /* 0xBF889338 */
  .extern U1EP3INV         /* 0xBF88933C */
  .extern U1EP4            /* 0xBF889340 */
  .extern U1EP4CLR         /* 0xBF889344 */
  .extern U1EP4SET         /* 0xBF889348 */
  .extern U1EP4INV         /* 0xBF88934C */
  .extern U1EP5            /* 0xBF889350 */
  .extern U1EP5CLR         /* 0xBF889354 */
  .extern U1EP5SET         /* 0xBF889358 */
  .extern U1EP5INV         /* 0xBF88935C */
  .extern U1EP6            /* 0xBF889360 */
  .extern U1EP6CLR         /* 0xBF889364 */
  .extern U1EP6SET         /* 0xBF889368 */
  .extern U1EP6INV         /* 0xBF88936C */
  .extern U1EP7            /* 0xBF889370 */
  .extern U1EP7CLR         /* 0xBF889374 */
  .extern U1EP7SET         /* 0xBF889378 */
  .extern U1EP7INV         /* 0xBF88937C */
  .extern U1EP8            /* 0xBF889380 */
  .extern U1EP8CLR         /* 0xBF889384 */
  .extern U1EP8SET         /* 0xBF889388 */
  .extern U1EP8INV         /* 0xBF88938C */
  .extern U1EP9            /* 0xBF889390 */
  .extern U1EP9CLR         /* 0xBF889394 */
  .extern U1EP9SET         /* 0xBF889398 */
  .extern U1EP9INV         /* 0xBF88939C */
  .extern U1EP10           /* 0xBF8893A0 */
  .extern U1EP10CLR        /* 0xBF8893A4 */
  .extern U1EP10SET        /* 0xBF8893A8 */
  .extern U1EP10INV        /* 0xBF8893AC */
  .extern U1EP11           /* 0xBF8893B0 */
  .extern U1EP11CLR        /* 0xBF8893B4 */
  .extern U1EP11SET        /* 0xBF8893B8 */
  .extern U1EP11INV        /* 0xBF8893BC */
  .extern U1EP12           /* 0xBF8893C0 */
  .extern U1EP12CLR        /* 0xBF8893C4 */
  .extern U1EP12SET        /* 0xBF8893C8 */
  .extern U1EP12INV        /* 0xBF8893CC */
  .extern U1EP13           /* 0xBF8893D0 */
  .extern U1EP13CLR        /* 0xBF8893D4 */
  .extern U1EP13SET        /* 0xBF8893D8 */
  .extern U1EP13INV        /* 0xBF8893DC */
  .extern U1EP14           /* 0xBF8893E0 */
  .extern U1EP14CLR        /* 0xBF8893E4 */
  .extern U1EP14SET        /* 0xBF8893E8 */
  .extern U1EP14INV        /* 0xBF8893EC */
  .extern U1EP15           /* 0xBF8893F0 */
  .extern U1EP15CLR        /* 0xBF8893F4 */
  .extern U1EP15SET        /* 0xBF8893F8 */
  .extern U1EP15INV        /* 0xBF8893FC */
  .extern U2OTGIR          /* 0xBF88A040 */
  .extern U2OTGIRCLR       /* 0xBF88A044 */
  .extern U2OTGIE          /* 0xBF88A050 */
  .extern U2OTGIECLR       /* 0xBF88A054 */
  .extern U2OTGIESET       /* 0xBF88A058 */
  .extern U2OTGIEINV       /* 0xBF88A05C */
  .extern U2OTGSTAT        /* 0xBF88A060 */
  .extern U2OTGCON         /* 0xBF88A070 */
  .extern U2OTGCONCLR      /* 0xBF88A074 */
  .extern U2OTGCONSET      /* 0xBF88A078 */
  .extern U2OTGCONINV      /* 0xBF88A07C */
  .extern U2PWRC           /* 0xBF88A080 */
  .extern U2PWRCCLR        /* 0xBF88A084 */
  .extern U2PWRCSET        /* 0xBF88A088 */
  .extern U2PWRCINV        /* 0xBF88A08C */
  .extern U2IR             /* 0xBF88A200 */
  .extern U2IRCLR          /* 0xBF88A204 */
  .extern U2IE             /* 0xBF88A210 */
  .extern U2IECLR          /* 0xBF88A214 */
  .extern U2IESET          /* 0xBF88A218 */
  .extern U2IEINV          /* 0xBF88A21C */
  .extern U2EIR            /* 0xBF88A220 */
  .extern U2EIRCLR         /* 0xBF88A224 */
  .extern U2EIE            /* 0xBF88A230 */
  .extern U2EIECLR         /* 0xBF88A234 */
  .extern U2EIESET         /* 0xBF88A238 */
  .extern U2EIEINV         /* 0xBF88A23C */
  .extern U2STAT           /* 0xBF88A240 */
  .extern U2CON            /* 0xBF88A250 */
  .extern U2CONCLR         /* 0xBF88A254 */
  .extern U2CONSET         /* 0xBF88A258 */
  .extern U2CONINV         /* 0xBF88A25C */
  .extern U2ADDR           /* 0xBF88A260 */
  .extern U2ADDRCLR        /* 0xBF88A264 */
  .extern U2ADDRSET        /* 0xBF88A268 */
  .extern U2ADDRINV        /* 0xBF88A26C */
  .extern U2BDTP1          /* 0xBF88A270 */
  .extern U2BDTP1CLR       /* 0xBF88A274 */
  .extern U2BDTP1SET       /* 0xBF88A278 */
  .extern U2BDTP1INV       /* 0xBF88A27C */
