Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _PMD3_IC9MD_POSITION                     0x00000008
#define _PMD3_IC9MD_MASK                         0x00000100
#define _PMD3_IC9MD_LENGTH                       0x00000001

#define _PMD3_IC10MD_POSITION                    0x00000009
#define _PMD3_IC10MD_MASK                        0x00000200
#define _PMD3_IC10MD_LENGTH                      0x00000001

#define _PMD3_IC11MD_POSITION                    0x0000000A
#define _PMD3_IC11MD_MASK                        0x00000400
#define _PMD3_IC11MD_LENGTH                      0x00000001

#define _PMD3_IC12MD_POSITION                    0x0000000B
#define _PMD3_IC12MD_MASK                        0x00000800
#define _PMD3_IC12MD_LENGTH                      0x00000001

#define _PMD3_IC13MD_POSITION                    0x0000000C
#define _PMD3_IC13MD_MASK                        0x00001000
#define _PMD3_IC13MD_LENGTH                      0x00000001

#define _PMD3_IC14MD_POSITION                    0x0000000D
#define _PMD3_IC14MD_MASK                        0x00002000
#define _PMD3_IC14MD_LENGTH                      0x00000001

#define _PMD3_IC15MD_POSITION                    0x0000000E
#define _PMD3_IC15MD_MASK                        0x00004000
#define _PMD3_IC15MD_LENGTH                      0x00000001

#define _PMD3_IC16MD_POSITION                    0x0000000F
#define _PMD3_IC16MD_MASK                        0x00008000
#define _PMD3_IC16MD_LENGTH                      0x00000001

#define _PMD3_OC1MD_POSITION                     0x00000010
#define _PMD3_OC1MD_MASK                         0x00010000
#define _PMD3_OC1MD_LENGTH                       0x00000001

#define _PMD3_OC2MD_POSITION                     0x00000011
#define _PMD3_OC2MD_MASK                         0x00020000
#define _PMD3_OC2MD_LENGTH                       0x00000001

#define _PMD3_OC3MD_POSITION                     0x00000012
#define _PMD3_OC3MD_MASK                         0x00040000
#define _PMD3_OC3MD_LENGTH                       0x00000001

#define _PMD3_OC4MD_POSITION                     0x00000013
#define _PMD3_OC4MD_MASK                         0x00080000
#define _PMD3_OC4MD_LENGTH                       0x00000001

#define _PMD3_OC5MD_POSITION                     0x00000014
#define _PMD3_OC5MD_MASK                         0x00100000
#define _PMD3_OC5MD_LENGTH                       0x00000001

#define _PMD3_OC6MD_POSITION                     0x00000015
#define _PMD3_OC6MD_MASK                         0x00200000
#define _PMD3_OC6MD_LENGTH                       0x00000001

#define _PMD3_OC7MD_POSITION                     0x00000016
#define _PMD3_OC7MD_MASK                         0x00400000
#define _PMD3_OC7MD_LENGTH                       0x00000001

#define _PMD3_OC8MD_POSITION                     0x00000017
#define _PMD3_OC8MD_MASK                         0x00800000
#define _PMD3_OC8MD_LENGTH                       0x00000001

#define _PMD3_OC9MD_POSITION                     0x00000018
#define _PMD3_OC9MD_MASK                         0x01000000
#define _PMD3_OC9MD_LENGTH                       0x00000001

#define _PMD3_OC10MD_POSITION                    0x00000019
#define _PMD3_OC10MD_MASK                        0x02000000
#define _PMD3_OC10MD_LENGTH                      0x00000001

#define _PMD3_OC11MD_POSITION                    0x0000001A
#define _PMD3_OC11MD_MASK                        0x04000000
#define _PMD3_OC11MD_LENGTH                      0x00000001

#define _PMD3_OC12MD_POSITION                    0x0000001B
#define _PMD3_OC12MD_MASK                        0x08000000
#define _PMD3_OC12MD_LENGTH                      0x00000001

#define _PMD3_OC13MD_POSITION                    0x0000001C
#define _PMD3_OC13MD_MASK                        0x10000000
#define _PMD3_OC13MD_LENGTH                      0x00000001

#define _PMD3_OC14MD_POSITION                    0x0000001D
#define _PMD3_OC14MD_MASK                        0x20000000
#define _PMD3_OC14MD_LENGTH                      0x00000001

#define _PMD3_OC15MD_POSITION                    0x0000001E
#define _PMD3_OC15MD_MASK                        0x40000000
#define _PMD3_OC15MD_LENGTH                      0x00000001

#define _PMD3_OC16MD_POSITION                    0x0000001F
#define _PMD3_OC16MD_MASK                        0x80000000
#define _PMD3_OC16MD_LENGTH                      0x00000001

#define _PMD4_T1MD_POSITION                      0x00000000
#define _PMD4_T1MD_MASK                          0x00000001
#define _PMD4_T1MD_LENGTH                        0x00000001

#define _PMD4_T2MD_POSITION                      0x00000001
#define _PMD4_T2MD_MASK                          0x00000002
#define _PMD4_T2MD_LENGTH                        0x00000001

#define _PMD4_T3MD_POSITION                      0x00000002
#define _PMD4_T3MD_MASK                          0x00000004
#define _PMD4_T3MD_LENGTH                        0x00000001

#define _PMD4_T4MD_POSITION                      0x00000003
#define _PMD4_T4MD_MASK                          0x00000008
#define _PMD4_T4MD_LENGTH                        0x00000001

#define _PMD4_T5MD_POSITION                      0x00000004
#define _PMD4_T5MD_MASK                          0x00000010
#define _PMD4_T5MD_LENGTH                        0x00000001

#define _PMD4_T6MD_POSITION                      0x00000005
#define _PMD4_T6MD_MASK                          0x00000020
#define _PMD4_T6MD_LENGTH                        0x00000001

#define _PMD4_T7MD_POSITION                      0x00000006
#define _PMD4_T7MD_MASK                          0x00000040
#define _PMD4_T7MD_LENGTH                        0x00000001

#define _PMD4_T8MD_POSITION                      0x00000007
#define _PMD4_T8MD_MASK                          0x00000080
#define _PMD4_T8MD_LENGTH                        0x00000001

#define _PMD4_T9MD_POSITION                      0x00000008
#define _PMD4_T9MD_MASK                          0x00000100
#define _PMD4_T9MD_LENGTH                        0x00000001

#define _PMD4_PWM1MD_POSITION                    0x00000010
#define _PMD4_PWM1MD_MASK                        0x00010000
#define _PMD4_PWM1MD_LENGTH                      0x00000001

#define _PMD4_PWM2MD_POSITION                    0x00000011
#define _PMD4_PWM2MD_MASK                        0x00020000
#define _PMD4_PWM2MD_LENGTH                      0x00000001

#define _PMD4_PWM3MD_POSITION                    0x00000012
#define _PMD4_PWM3MD_MASK                        0x00040000
#define _PMD4_PWM3MD_LENGTH                      0x00000001

#define _PMD4_PWM4MD_POSITION                    0x00000013
#define _PMD4_PWM4MD_MASK                        0x00080000
#define _PMD4_PWM4MD_LENGTH                      0x00000001

