Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _FLT1R_FLT1R_POSITION                    0x00000000
#define _FLT1R_FLT1R_MASK                        0x0000000F
#define _FLT1R_FLT1R_LENGTH                      0x00000004

#define _FLT2R_FLT2R_POSITION                    0x00000000
#define _FLT2R_FLT2R_MASK                        0x0000000F
#define _FLT2R_FLT2R_LENGTH                      0x00000004

#define _IC10R_IC10R_POSITION                    0x00000000
#define _IC10R_IC10R_MASK                        0x0000000F
#define _IC10R_IC10R_LENGTH                      0x00000004

#define _IC11R_IC11R_POSITION                    0x00000000
#define _IC11R_IC11R_MASK                        0x0000000F
#define _IC11R_IC11R_LENGTH                      0x00000004

#define _IC12R_IC12R_POSITION                    0x00000000
#define _IC12R_IC12R_MASK                        0x0000000F
#define _IC12R_IC12R_LENGTH                      0x00000004

#define _IC13R_IC13R_POSITION                    0x00000000
#define _IC13R_IC13R_MASK                        0x0000000F
#define _IC13R_IC13R_LENGTH                      0x00000004

#define _IC14R_IC14R_POSITION                    0x00000000
#define _IC14R_IC14R_MASK                        0x0000000F
#define _IC14R_IC14R_LENGTH                      0x00000004

#define _IC15R_IC15R_POSITION                    0x00000000
#define _IC15R_IC15R_MASK                        0x0000000F
#define _IC15R_IC15R_LENGTH                      0x00000004

#define _IC16R_IC16R_POSITION                    0x00000000
#define _IC16R_IC16R_MASK                        0x0000000F
#define _IC16R_IC16R_LENGTH                      0x00000004

#define _SCK5R_SCK5R_POSITION                    0x00000000
#define _SCK5R_SCK5R_MASK                        0x0000000F
#define _SCK5R_SCK5R_LENGTH                      0x00000004

#define _SDI5R_SDI5R_POSITION                    0x00000000
#define _SDI5R_SDI5R_MASK                        0x0000000F
#define _SDI5R_SDI5R_LENGTH                      0x00000004

#define _SS5R_SS5R_POSITION                      0x00000000
#define _SS5R_SS5R_MASK                          0x0000000F
#define _SS5R_SS5R_LENGTH                        0x00000004

#define _SCK6R_SCK6R_POSITION                    0x00000000
#define _SCK6R_SCK6R_MASK                        0x0000000F
#define _SCK6R_SCK6R_LENGTH                      0x00000004

#define _SDI6R_SDI6R_POSITION                    0x00000000
#define _SDI6R_SDI6R_MASK                        0x0000000F
#define _SDI6R_SDI6R_LENGTH                      0x00000004

#define _SS6R_SS6R_POSITION                      0x00000000
#define _SS6R_SS6R_MASK                          0x0000000F
#define _SS6R_SS6R_LENGTH                        0x00000004

#define _C3RXR_C3RXR_POSITION                    0x00000000
#define _C3RXR_C3RXR_MASK                        0x0000000F
#define _C3RXR_C3RXR_LENGTH                      0x00000004

#define _C4RXR_C4RXR_POSITION                    0x00000000
#define _C4RXR_C4RXR_MASK                        0x0000000F
#define _C4RXR_C4RXR_LENGTH                      0x00000004

#define _QEA3R_QEA3R_POSITION                    0x00000000
#define _QEA3R_QEA3R_MASK                        0x0000000F
#define _QEA3R_QEA3R_LENGTH                      0x00000004

#define _QEB3R_QEB3R_POSITION                    0x00000000
#define _QEB3R_QEB3R_MASK                        0x0000000F
#define _QEB3R_QEB3R_LENGTH                      0x00000004

#define _INDX3R_INDX3R_POSITION                  0x00000000
#define _INDX3R_INDX3R_MASK                      0x0000000F
#define _INDX3R_INDX3R_LENGTH                    0x00000004

#define _HOME3R_HOME3R_POSITION                  0x00000000
#define _HOME3R_HOME3R_MASK                      0x0000000F
#define _HOME3R_HOME3R_LENGTH                    0x00000004

#define _QEA4R_QEA4R_POSITION                    0x00000000
#define _QEA4R_QEA4R_MASK                        0x0000000F
#define _QEA4R_QEA4R_LENGTH                      0x00000004

#define _QEB4R_QEB4R_POSITION                    0x00000000
#define _QEB4R_QEB4R_MASK                        0x0000000F
#define _QEB4R_QEB4R_LENGTH                      0x00000004

#define _INDX4R_INDX4R_POSITION                  0x00000000
#define _INDX4R_INDX4R_MASK                      0x0000000F
#define _INDX4R_INDX4R_LENGTH                    0x00000004

#define _HOME4R_HOME4R_POSITION                  0x00000000
#define _HOME4R_HOME4R_MASK                      0x0000000F
#define _HOME4R_HOME4R_LENGTH                    0x00000004

#define _QEA5R_QEA5R_POSITION                    0x00000000
#define _QEA5R_QEA5R_MASK                        0x0000000F
#define _QEA5R_QEA5R_LENGTH                      0x00000004

#define _QEB5R_QEB5R_POSITION                    0x00000000
#define _QEB5R_QEB5R_MASK                        0x0000000F
#define _QEB5R_QEB5R_LENGTH                      0x00000004

#define _INDX5R_INDX5R_POSITION                  0x00000000
#define _INDX5R_INDX5R_MASK                      0x0000000F
#define _INDX5R_INDX5R_LENGTH                    0x00000004

#define _HOME5R_HOME5R_POSITION                  0x00000000
#define _HOME5R_HOME5R_MASK                      0x0000000F
#define _HOME5R_HOME5R_LENGTH                    0x00000004

#define _QEA6R_QEA6R_POSITION                    0x00000000
#define _QEA6R_QEA6R_MASK                        0x0000000F
#define _QEA6R_QEA6R_LENGTH                      0x00000004

#define _QEB6R_QEB6R_POSITION                    0x00000000
#define _QEB6R_QEB6R_MASK                        0x0000000F
#define _QEB6R_QEB6R_LENGTH                      0x00000004

#define _INDX6R_INDX6R_POSITION                  0x00000000
#define _INDX6R_INDX6R_MASK                      0x0000000F
#define _INDX6R_INDX6R_LENGTH                    0x00000004

#define _HOME6R_HOME6R_POSITION                  0x00000000
#define _HOME6R_HOME6R_MASK                      0x0000000F
#define _HOME6R_HOME6R_LENGTH                    0x00000004

#define _RPA0R_RPA0R_POSITION                    0x00000000
#define _RPA0R_RPA0R_MASK                        0x0000001F
#define _RPA0R_RPA0R_LENGTH                      0x00000005

