Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _IEC6_OC12IE_POSITION                    0x0000000D
#define _IEC6_OC12IE_MASK                        0x00002000
#define _IEC6_OC12IE_LENGTH                      0x00000001

#define _IEC6_IC13EIE_POSITION                   0x0000000E
#define _IEC6_IC13EIE_MASK                       0x00004000
#define _IEC6_IC13EIE_LENGTH                     0x00000001

#define _IEC6_IC13IE_POSITION                    0x0000000F
#define _IEC6_IC13IE_MASK                        0x00008000
#define _IEC6_IC13IE_LENGTH                      0x00000001

#define _IEC6_OC13IE_POSITION                    0x00000010
#define _IEC6_OC13IE_MASK                        0x00010000
#define _IEC6_OC13IE_LENGTH                      0x00000001

#define _IEC6_IC14EIE_POSITION                   0x00000011
#define _IEC6_IC14EIE_MASK                       0x00020000
#define _IEC6_IC14EIE_LENGTH                     0x00000001

#define _IEC6_IC14IE_POSITION                    0x00000012
#define _IEC6_IC14IE_MASK                        0x00040000
#define _IEC6_IC14IE_LENGTH                      0x00000001

#define _IEC6_OC14IE_POSITION                    0x00000013
#define _IEC6_OC14IE_MASK                        0x00080000
#define _IEC6_OC14IE_LENGTH                      0x00000001

#define _IEC6_IC15EIE_POSITION                   0x00000014
#define _IEC6_IC15EIE_MASK                       0x00100000
#define _IEC6_IC15EIE_LENGTH                     0x00000001

#define _IEC6_IC15IE_POSITION                    0x00000015
#define _IEC6_IC15IE_MASK                        0x00200000
#define _IEC6_IC15IE_LENGTH                      0x00000001

#define _IEC6_OC15IE_POSITION                    0x00000016
#define _IEC6_OC15IE_MASK                        0x00400000
#define _IEC6_OC15IE_LENGTH                      0x00000001

#define _IEC6_IC16EIE_POSITION                   0x00000017
#define _IEC6_IC16EIE_MASK                       0x00800000
#define _IEC6_IC16EIE_LENGTH                     0x00000001

#define _IEC6_IC16IE_POSITION                    0x00000018
#define _IEC6_IC16IE_MASK                        0x01000000
#define _IEC6_IC16IE_LENGTH                      0x00000001

#define _IEC6_OC16IE_POSITION                    0x00000019
#define _IEC6_OC16IE_MASK                        0x02000000
#define _IEC6_OC16IE_LENGTH                      0x00000001

#define _IEC6_SPI3EIE_POSITION                   0x0000001A
#define _IEC6_SPI3EIE_MASK                       0x04000000
#define _IEC6_SPI3EIE_LENGTH                     0x00000001

#define _IEC6_SPI3RXIE_POSITION                  0x0000001B
#define _IEC6_SPI3RXIE_MASK                      0x08000000
#define _IEC6_SPI3RXIE_LENGTH                    0x00000001

#define _IEC6_SPI3TXIE_POSITION                  0x0000001C
#define _IEC6_SPI3TXIE_MASK                      0x10000000
#define _IEC6_SPI3TXIE_LENGTH                    0x00000001

#define _IEC6_SPI4EIE_POSITION                   0x0000001D
#define _IEC6_SPI4EIE_MASK                       0x20000000
#define _IEC6_SPI4EIE_LENGTH                     0x00000001

#define _IEC6_SPI4RXIE_POSITION                  0x0000001E
#define _IEC6_SPI4RXIE_MASK                      0x40000000
#define _IEC6_SPI4RXIE_LENGTH                    0x00000001

#define _IEC6_SPI4TXIE_POSITION                  0x0000001F
#define _IEC6_SPI4TXIE_MASK                      0x80000000
#define _IEC6_SPI4TXIE_LENGTH                    0x00000001

#define _IEC6_w_POSITION                         0x00000000
#define _IEC6_w_MASK                             0xFFFFFFFF
#define _IEC6_w_LENGTH                           0x00000020

#define _IEC7_SPI5EIE_POSITION                   0x00000000
#define _IEC7_SPI5EIE_MASK                       0x00000001
#define _IEC7_SPI5EIE_LENGTH                     0x00000001

#define _IEC7_SPI5RXIE_POSITION                  0x00000001
#define _IEC7_SPI5RXIE_MASK                      0x00000002
#define _IEC7_SPI5RXIE_LENGTH                    0x00000001

#define _IEC7_SPI5TXIE_POSITION                  0x00000002
#define _IEC7_SPI5TXIE_MASK                      0x00000004
#define _IEC7_SPI5TXIE_LENGTH                    0x00000001

#define _IEC7_SPI6EIE_POSITION                   0x00000003
#define _IEC7_SPI6EIE_MASK                       0x00000008
#define _IEC7_SPI6EIE_LENGTH                     0x00000001

#define _IEC7_SPI6RXIE_POSITION                  0x00000004
#define _IEC7_SPI6RXIE_MASK                      0x00000010
#define _IEC7_SPI6RXIE_LENGTH                    0x00000001

#define _IEC7_SPI6TXIE_POSITION                  0x00000005
#define _IEC7_SPI6TXIE_MASK                      0x00000020
#define _IEC7_SPI6TXIE_LENGTH                    0x00000001

#define _IEC7_SBIE_POSITION                      0x00000006
#define _IEC7_SBIE_MASK                          0x00000040
#define _IEC7_SBIE_LENGTH                        0x00000001

#define _IEC7_PTGSTEPIE_POSITION                 0x00000007
#define _IEC7_PTGSTEPIE_MASK                     0x00000080
#define _IEC7_PTGSTEPIE_LENGTH                   0x00000001

#define _IEC7_PTGWDTIE_POSITION                  0x00000008
#define _IEC7_PTGWDTIE_MASK                      0x00000100
#define _IEC7_PTGWDTIE_LENGTH                    0x00000001

#define _IEC7_PTG0TR0_POSITION                   0x00000009
#define _IEC7_PTG0TR0_MASK                       0x00000200
#define _IEC7_PTG0TR0_LENGTH                     0x00000001

#define _IEC7_PTG0TR1_POSITION                   0x0000000A
#define _IEC7_PTG0TR1_MASK                       0x00000400
#define _IEC7_PTG0TR1_LENGTH                     0x00000001

#define _IEC7_PTG0TR2_POSITION                   0x0000000B
#define _IEC7_PTG0TR2_MASK                       0x00000800
#define _IEC7_PTG0TR2_LENGTH                     0x00000001

#define _IEC7_PTG0TR3_POSITION                   0x0000000C
#define _IEC7_PTG0TR3_MASK                       0x00001000
#define _IEC7_PTG0TR3_LENGTH                     0x00000001

#define _IEC7_PWM7IE_POSITION                    0x0000000E
#define _IEC7_PWM7IE_MASK                        0x00004000
#define _IEC7_PWM7IE_LENGTH                      0x00000001

#define _IEC7_PWM8IE_POSITION                    0x0000000F
#define _IEC7_PWM8IE_MASK                        0x00008000
#define _IEC7_PWM8IE_LENGTH                      0x00000001

#define _IEC7_PWM9IE_POSITION                    0x00000010
#define _IEC7_PWM9IE_MASK                        0x00010000
#define _IEC7_PWM9IE_LENGTH                      0x00000001

#define _IEC7_PWM10IE_POSITION                   0x00000011
#define _IEC7_PWM10IE_MASK                       0x00020000
#define _IEC7_PWM10IE_LENGTH                     0x00000001

