Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _IPC33_AD1D29IS_POSITION                 0x00000018
#define _IPC33_AD1D29IS_MASK                     0x03000000
#define _IPC33_AD1D29IS_LENGTH                   0x00000002

#define _IPC33_AD1D29IP_POSITION                 0x0000001A
#define _IPC33_AD1D29IP_MASK                     0x1C000000
#define _IPC33_AD1D29IP_LENGTH                   0x00000003

#define _IPC33_w_POSITION                        0x00000000
#define _IPC33_w_MASK                            0xFFFFFFFF
#define _IPC33_w_LENGTH                          0x00000020

#define _IPC34_AD1D30IS_POSITION                 0x00000000
#define _IPC34_AD1D30IS_MASK                     0x00000003
#define _IPC34_AD1D30IS_LENGTH                   0x00000002

#define _IPC34_AD1D30IP_POSITION                 0x00000002
#define _IPC34_AD1D30IP_MASK                     0x0000001C
#define _IPC34_AD1D30IP_LENGTH                   0x00000003

#define _IPC34_AD1D31IS_POSITION                 0x00000008
#define _IPC34_AD1D31IS_MASK                     0x00000300
#define _IPC34_AD1D31IS_LENGTH                   0x00000002

#define _IPC34_AD1D31IP_POSITION                 0x0000000A
#define _IPC34_AD1D31IP_MASK                     0x00001C00
#define _IPC34_AD1D31IP_LENGTH                   0x00000003

#define _IPC34_AD1D32IS_POSITION                 0x00000010
#define _IPC34_AD1D32IS_MASK                     0x00030000
#define _IPC34_AD1D32IS_LENGTH                   0x00000002

#define _IPC34_AD1D32IP_POSITION                 0x00000012
#define _IPC34_AD1D32IP_MASK                     0x001C0000
#define _IPC34_AD1D32IP_LENGTH                   0x00000003

#define _IPC34_AD1D33IS_POSITION                 0x00000018
#define _IPC34_AD1D33IS_MASK                     0x03000000
#define _IPC34_AD1D33IS_LENGTH                   0x00000002

#define _IPC34_AD1D33IP_POSITION                 0x0000001A
#define _IPC34_AD1D33IP_MASK                     0x1C000000
#define _IPC34_AD1D33IP_LENGTH                   0x00000003

#define _IPC34_w_POSITION                        0x00000000
#define _IPC34_w_MASK                            0xFFFFFFFF
#define _IPC34_w_LENGTH                          0x00000020

#define _IPC35_AD1D34IS_POSITION                 0x00000000
#define _IPC35_AD1D34IS_MASK                     0x00000003
#define _IPC35_AD1D34IS_LENGTH                   0x00000002

#define _IPC35_AD1D34IP_POSITION                 0x00000002
#define _IPC35_AD1D34IP_MASK                     0x0000001C
#define _IPC35_AD1D34IP_LENGTH                   0x00000003

#define _IPC35_AD1D35IS_POSITION                 0x00000008
#define _IPC35_AD1D35IS_MASK                     0x00000300
#define _IPC35_AD1D35IS_LENGTH                   0x00000002

#define _IPC35_AD1D35IP_POSITION                 0x0000000A
#define _IPC35_AD1D35IP_MASK                     0x00001C00
#define _IPC35_AD1D35IP_LENGTH                   0x00000003

#define _IPC35_AD1D36IS_POSITION                 0x00000010
#define _IPC35_AD1D36IS_MASK                     0x00030000
#define _IPC35_AD1D36IS_LENGTH                   0x00000002

#define _IPC35_AD1D36IP_POSITION                 0x00000012
#define _IPC35_AD1D36IP_MASK                     0x001C0000
#define _IPC35_AD1D36IP_LENGTH                   0x00000003

#define _IPC35_AD1D37IS_POSITION                 0x00000018
#define _IPC35_AD1D37IS_MASK                     0x03000000
#define _IPC35_AD1D37IS_LENGTH                   0x00000002

#define _IPC35_AD1D37IP_POSITION                 0x0000001A
#define _IPC35_AD1D37IP_MASK                     0x1C000000
#define _IPC35_AD1D37IP_LENGTH                   0x00000003

#define _IPC35_w_POSITION                        0x00000000
#define _IPC35_w_MASK                            0xFFFFFFFF
#define _IPC35_w_LENGTH                          0x00000020

#define _IPC36_AD1D38IS_POSITION                 0x00000000
#define _IPC36_AD1D38IS_MASK                     0x00000003
#define _IPC36_AD1D38IS_LENGTH                   0x00000002

#define _IPC36_AD1D38IP_POSITION                 0x00000002
#define _IPC36_AD1D38IP_MASK                     0x0000001C
#define _IPC36_AD1D38IP_LENGTH                   0x00000003

#define _IPC36_AD1D39IS_POSITION                 0x00000008
#define _IPC36_AD1D39IS_MASK                     0x00000300
#define _IPC36_AD1D39IS_LENGTH                   0x00000002

#define _IPC36_AD1D39IP_POSITION                 0x0000000A
#define _IPC36_AD1D39IP_MASK                     0x00001C00
#define _IPC36_AD1D39IP_LENGTH                   0x00000003

#define _IPC36_AD1D40IS_POSITION                 0x00000010
#define _IPC36_AD1D40IS_MASK                     0x00030000
#define _IPC36_AD1D40IS_LENGTH                   0x00000002

#define _IPC36_AD1D40IP_POSITION                 0x00000012
#define _IPC36_AD1D40IP_MASK                     0x001C0000
#define _IPC36_AD1D40IP_LENGTH                   0x00000003

#define _IPC36_AD1D41IS_POSITION                 0x00000018
#define _IPC36_AD1D41IS_MASK                     0x03000000
#define _IPC36_AD1D41IS_LENGTH                   0x00000002

#define _IPC36_AD1D41IP_POSITION                 0x0000001A
#define _IPC36_AD1D41IP_MASK                     0x1C000000
#define _IPC36_AD1D41IP_LENGTH                   0x00000003

#define _IPC36_w_POSITION                        0x00000000
#define _IPC36_w_MASK                            0xFFFFFFFF
#define _IPC36_w_LENGTH                          0x00000020

#define _IPC37_AD1D45IS_POSITION                 0x00000018
#define _IPC37_AD1D45IS_MASK                     0x03000000
#define _IPC37_AD1D45IS_LENGTH                   0x00000002

#define _IPC37_AD1D45IP_POSITION                 0x0000001A
#define _IPC37_AD1D45IP_MASK                     0x1C000000
#define _IPC37_AD1D45IP_LENGTH                   0x00000003

#define _IPC37_w_POSITION                        0x00000000
#define _IPC37_w_MASK                            0xFFFFFFFF
#define _IPC37_w_LENGTH                          0x00000020

#define _IPC38_AD1D46IS_POSITION                 0x00000000
#define _IPC38_AD1D46IS_MASK                     0x00000003
#define _IPC38_AD1D46IS_LENGTH                   0x00000002

#define _IPC38_AD1D46IP_POSITION                 0x00000002
#define _IPC38_AD1D46IP_MASK                     0x0000001C
#define _IPC38_AD1D46IP_LENGTH                   0x00000003

#define _IPC38_AD1D47IS_POSITION                 0x00000008
#define _IPC38_AD1D47IS_MASK                     0x00000300
#define _IPC38_AD1D47IS_LENGTH                   0x00000002

#define _IPC38_AD1D47IP_POSITION                 0x0000000A
#define _IPC38_AD1D47IP_MASK                     0x00001C00
#define _IPC38_AD1D47IP_LENGTH                   0x00000003

