Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _IPC46_DMA7IS_POSITION                   0x00000008
#define _IPC46_DMA7IS_MASK                       0x00000300
#define _IPC46_DMA7IS_LENGTH                     0x00000002

#define _IPC46_DMA7IP_POSITION                   0x0000000A
#define _IPC46_DMA7IP_MASK                       0x00001C00
#define _IPC46_DMA7IP_LENGTH                     0x00000003

#define _IPC46_DATAEEIS_POSITION                 0x00000010
#define _IPC46_DATAEEIS_MASK                     0x00030000
#define _IPC46_DATAEEIS_LENGTH                   0x00000002

#define _IPC46_DATAEEIP_POSITION                 0x00000012
#define _IPC46_DATAEEIP_MASK                     0x001C0000
#define _IPC46_DATAEEIP_LENGTH                   0x00000003

#define _IPC46_CAN3IS_POSITION                   0x00000018
#define _IPC46_CAN3IS_MASK                       0x03000000
#define _IPC46_CAN3IS_LENGTH                     0x00000002

#define _IPC46_CAN3IP_POSITION                   0x0000001A
#define _IPC46_CAN3IP_MASK                       0x1C000000
#define _IPC46_CAN3IP_LENGTH                     0x00000003

#define _IPC46_w_POSITION                        0x00000000
#define _IPC46_w_MASK                            0xFFFFFFFF
#define _IPC46_w_LENGTH                          0x00000020

#define _IPC47_CAN4IS_POSITION                   0x00000000
#define _IPC47_CAN4IS_MASK                       0x00000003
#define _IPC47_CAN4IS_LENGTH                     0x00000002

#define _IPC47_CAN4IP_POSITION                   0x00000002
#define _IPC47_CAN4IP_MASK                       0x0000001C
#define _IPC47_CAN4IP_LENGTH                     0x00000003

#define _IPC47_QEI3IS_POSITION                   0x00000008
#define _IPC47_QEI3IS_MASK                       0x00000300
#define _IPC47_QEI3IS_LENGTH                     0x00000002

#define _IPC47_QEI3IP_POSITION                   0x0000000A
#define _IPC47_QEI3IP_MASK                       0x00001C00
#define _IPC47_QEI3IP_LENGTH                     0x00000003

#define _IPC47_QEI4IS_POSITION                   0x00000010
#define _IPC47_QEI4IS_MASK                       0x00030000
#define _IPC47_QEI4IS_LENGTH                     0x00000002

#define _IPC47_QEI4IP_POSITION                   0x00000012
#define _IPC47_QEI4IP_MASK                       0x001C0000
#define _IPC47_QEI4IP_LENGTH                     0x00000003

#define _IPC47_QEI5IS_POSITION                   0x00000018
#define _IPC47_QEI5IS_MASK                       0x03000000
#define _IPC47_QEI5IS_LENGTH                     0x00000002

#define _IPC47_QEI5IP_POSITION                   0x0000001A
#define _IPC47_QEI5IP_MASK                       0x1C000000
#define _IPC47_QEI5IP_LENGTH                     0x00000003

#define _IPC47_w_POSITION                        0x00000000
#define _IPC47_w_MASK                            0xFFFFFFFF
#define _IPC47_w_LENGTH                          0x00000020

#define _IPC48_QEI6IS_POSITION                   0x00000000
#define _IPC48_QEI6IS_MASK                       0x00000003
#define _IPC48_QEI6IS_LENGTH                     0x00000002

#define _IPC48_QEI6IP_POSITION                   0x00000002
#define _IPC48_QEI6IP_MASK                       0x0000001C
#define _IPC48_QEI6IP_LENGTH                     0x00000003

#define _IPC48_I2C4BIS_POSITION                  0x00000010
#define _IPC48_I2C4BIS_MASK                      0x00030000
#define _IPC48_I2C4BIS_LENGTH                    0x00000002

#define _IPC48_I2C4BIP_POSITION                  0x00000012
#define _IPC48_I2C4BIP_MASK                      0x001C0000
#define _IPC48_I2C4BIP_LENGTH                    0x00000003

#define _IPC48_I2C4SIS_POSITION                  0x00000018
#define _IPC48_I2C4SIS_MASK                      0x03000000
#define _IPC48_I2C4SIS_LENGTH                    0x00000002

#define _IPC48_I2C4SIP_POSITION                  0x0000001A
#define _IPC48_I2C4SIP_MASK                      0x1C000000
#define _IPC48_I2C4SIP_LENGTH                    0x00000003

#define _IPC48_w_POSITION                        0x00000000
#define _IPC48_w_MASK                            0xFFFFFFFF
#define _IPC48_w_LENGTH                          0x00000020

#define _IPC49_I2C4MIS_POSITION                  0x00000000
#define _IPC49_I2C4MIS_MASK                      0x00000003
#define _IPC49_I2C4MIS_LENGTH                    0x00000002

#define _IPC49_I2C4MIP_POSITION                  0x00000002
#define _IPC49_I2C4MIP_MASK                      0x0000001C
#define _IPC49_I2C4MIP_LENGTH                    0x00000003

#define _IPC49_IC10EIS_POSITION                  0x00000008
#define _IPC49_IC10EIS_MASK                      0x00000300
#define _IPC49_IC10EIS_LENGTH                    0x00000002

#define _IPC49_IC10EIP_POSITION                  0x0000000A
#define _IPC49_IC10EIP_MASK                      0x00001C00
#define _IPC49_IC10EIP_LENGTH                    0x00000003

#define _IPC49_IC10IS_POSITION                   0x00000010
#define _IPC49_IC10IS_MASK                       0x00030000
#define _IPC49_IC10IS_LENGTH                     0x00000002

#define _IPC49_IC10IP_POSITION                   0x00000012
#define _IPC49_IC10IP_MASK                       0x001C0000
#define _IPC49_IC10IP_LENGTH                     0x00000003

#define _IPC49_OC10IS_POSITION                   0x00000018
#define _IPC49_OC10IS_MASK                       0x03000000
#define _IPC49_OC10IS_LENGTH                     0x00000002

#define _IPC49_OC10IP_POSITION                   0x0000001A
#define _IPC49_OC10IP_MASK                       0x1C000000
#define _IPC49_OC10IP_LENGTH                     0x00000003

#define _IPC49_w_POSITION                        0x00000000
#define _IPC49_w_MASK                            0xFFFFFFFF
#define _IPC49_w_LENGTH                          0x00000020

#define _IPC50_IC11EIS_POSITION                  0x00000000
#define _IPC50_IC11EIS_MASK                      0x00000003
#define _IPC50_IC11EIS_LENGTH                    0x00000002

#define _IPC50_IC11EIP_POSITION                  0x00000002
#define _IPC50_IC11EIP_MASK                      0x0000001C
#define _IPC50_IC11EIP_LENGTH                    0x00000003

#define _IPC50_IC11IS_POSITION                   0x00000008
#define _IPC50_IC11IS_MASK                       0x00000300
#define _IPC50_IC11IS_LENGTH                     0x00000002

#define _IPC50_IC11IP_POSITION                   0x0000000A
#define _IPC50_IC11IP_MASK                       0x00001C00
#define _IPC50_IC11IP_LENGTH                     0x00000003

#define _IPC50_OC11IS_POSITION                   0x00000010
#define _IPC50_OC11IS_MASK                       0x00030000
#define _IPC50_OC11IS_LENGTH                     0x00000002

#define _IPC50_OC11IP_POSITION                   0x00000012
#define _IPC50_OC11IP_MASK                       0x001C0000
#define _IPC50_OC11IP_LENGTH                     0x00000003

#define _IPC50_IC12EIS_POSITION                  0x00000018
#define _IPC50_IC12EIS_MASK                      0x03000000
#define _IPC50_IC12EIS_LENGTH                    0x00000002

