Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _IPC59_PWM7IS_POSITION                   0x00000010
#define _IPC59_PWM7IS_MASK                       0x00030000
#define _IPC59_PWM7IS_LENGTH                     0x00000002

#define _IPC59_PWM7IP_POSITION                   0x00000012
#define _IPC59_PWM7IP_MASK                       0x001C0000
#define _IPC59_PWM7IP_LENGTH                     0x00000003

#define _IPC59_PWM8IS_POSITION                   0x00000018
#define _IPC59_PWM8IS_MASK                       0x03000000
#define _IPC59_PWM8IS_LENGTH                     0x00000002

#define _IPC59_PWM8IP_POSITION                   0x0000001A
#define _IPC59_PWM8IP_MASK                       0x1C000000
#define _IPC59_PWM8IP_LENGTH                     0x00000003

#define _IPC59_w_POSITION                        0x00000000
#define _IPC59_w_MASK                            0xFFFFFFFF
#define _IPC59_w_LENGTH                          0x00000020

#define _IPC60_PWM9IS_POSITION                   0x00000000
#define _IPC60_PWM9IS_MASK                       0x00000003
#define _IPC60_PWM9IS_LENGTH                     0x00000002

#define _IPC60_PWM9IP_POSITION                   0x00000002
#define _IPC60_PWM9IP_MASK                       0x0000001C
#define _IPC60_PWM9IP_LENGTH                     0x00000003

#define _IPC60_PWM10IS_POSITION                  0x00000008
#define _IPC60_PWM10IS_MASK                      0x00000300
#define _IPC60_PWM10IS_LENGTH                    0x00000002

#define _IPC60_PWM10IP_POSITION                  0x0000000A
#define _IPC60_PWM10IP_MASK                      0x00001C00
#define _IPC60_PWM10IP_LENGTH                    0x00000003

#define _IPC60_PWM11IS_POSITION                  0x00000010
#define _IPC60_PWM11IS_MASK                      0x00030000
#define _IPC60_PWM11IS_LENGTH                    0x00000002

#define _IPC60_PWM11IP_POSITION                  0x00000012
#define _IPC60_PWM11IP_MASK                      0x001C0000
#define _IPC60_PWM11IP_LENGTH                    0x00000003

#define _IPC60_PWM12IS_POSITION                  0x00000018
#define _IPC60_PWM12IS_MASK                      0x03000000
#define _IPC60_PWM12IS_LENGTH                    0x00000002

#define _IPC60_PWM12IP_POSITION                  0x0000001A
#define _IPC60_PWM12IP_MASK                      0x1C000000
#define _IPC60_PWM12IP_LENGTH                    0x00000003

#define _IPC60_w_POSITION                        0x00000000
#define _IPC60_w_MASK                            0xFFFFFFFF
#define _IPC60_w_LENGTH                          0x00000020

#define _IPC61_USB2IS_POSITION                   0x00000000
#define _IPC61_USB2IS_MASK                       0x00000003
#define _IPC61_USB2IS_LENGTH                     0x00000002

#define _IPC61_USB2IP_POSITION                   0x00000002
#define _IPC61_USB2IP_MASK                       0x0000001C
#define _IPC61_USB2IP_LENGTH                     0x00000003

#define _IPC61_AD1DC3IS_POSITION                 0x00000008
#define _IPC61_AD1DC3IS_MASK                     0x00000300
#define _IPC61_AD1DC3IS_LENGTH                   0x00000002

#define _IPC61_AD1DC3IP_POSITION                 0x0000000A
#define _IPC61_AD1DC3IP_MASK                     0x00001C00
#define _IPC61_AD1DC3IP_LENGTH                   0x00000003

#define _IPC61_AD1DC4IS_POSITION                 0x00000010
#define _IPC61_AD1DC4IS_MASK                     0x00030000
#define _IPC61_AD1DC4IS_LENGTH                   0x00000002

#define _IPC61_AD1DC4IP_POSITION                 0x00000012
#define _IPC61_AD1DC4IP_MASK                     0x001C0000
#define _IPC61_AD1DC4IP_LENGTH                   0x00000003

#define _IPC61_w_POSITION                        0x00000000
#define _IPC61_w_MASK                            0xFFFFFFFF
#define _IPC61_w_LENGTH                          0x00000020

#define _IPC62_w_POSITION                        0x00000000
#define _IPC62_w_MASK                            0xFFFFFFFF
#define _IPC62_w_LENGTH                          0x00000020

#define _IPC63_CPCIS_POSITION                    0x00000010
#define _IPC63_CPCIS_MASK                        0x00030000
#define _IPC63_CPCIS_LENGTH                      0x00000002

#define _IPC63_CPCIP_POSITION                    0x00000012
#define _IPC63_CPCIP_MASK                        0x001C0000
#define _IPC63_CPCIP_LENGTH                      0x00000003

#define _IPC63_CFDCIS_POSITION                   0x00000018
#define _IPC63_CFDCIS_MASK                       0x03000000
#define _IPC63_CFDCIS_LENGTH                     0x00000002

#define _IPC63_CFDCIP_POSITION                   0x0000001A
#define _IPC63_CFDCIP_MASK                       0x1C000000
#define _IPC63_CFDCIP_LENGTH                     0x00000003

#define _IPC63_w_POSITION                        0x00000000
#define _IPC63_w_MASK                            0xFFFFFFFF
#define _IPC63_w_LENGTH                          0x00000020

#define _OFF000_VOFF_POSITION                    0x00000001
#define _OFF000_VOFF_MASK                        0x0003FFFE
#define _OFF000_VOFF_LENGTH                      0x00000011

#define _OFF001_VOFF_POSITION                    0x00000001
#define _OFF001_VOFF_MASK                        0x0003FFFE
#define _OFF001_VOFF_LENGTH                      0x00000011

#define _OFF002_VOFF_POSITION                    0x00000001
#define _OFF002_VOFF_MASK                        0x0003FFFE
#define _OFF002_VOFF_LENGTH                      0x00000011

#define _OFF003_VOFF_POSITION                    0x00000001
#define _OFF003_VOFF_MASK                        0x0003FFFE
#define _OFF003_VOFF_LENGTH                      0x00000011

#define _OFF004_VOFF_POSITION                    0x00000001
#define _OFF004_VOFF_MASK                        0x0003FFFE
#define _OFF004_VOFF_LENGTH                      0x00000011

#define _OFF005_VOFF_POSITION                    0x00000001
#define _OFF005_VOFF_MASK                        0x0003FFFE
#define _OFF005_VOFF_LENGTH                      0x00000011

#define _OFF006_VOFF_POSITION                    0x00000001
#define _OFF006_VOFF_MASK                        0x0003FFFE
#define _OFF006_VOFF_LENGTH                      0x00000011

#define _OFF007_VOFF_POSITION                    0x00000001
#define _OFF007_VOFF_MASK                        0x0003FFFE
#define _OFF007_VOFF_LENGTH                      0x00000011

