Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _T7CON_TCS_POSITION                      0x00000001
#define _T7CON_TCS_MASK                          0x00000002
#define _T7CON_TCS_LENGTH                        0x00000001

#define _T7CON_T32_POSITION                      0x00000003
#define _T7CON_T32_MASK                          0x00000008
#define _T7CON_T32_LENGTH                        0x00000001

#define _T7CON_TCKPS_POSITION                    0x00000004
#define _T7CON_TCKPS_MASK                        0x00000070
#define _T7CON_TCKPS_LENGTH                      0x00000003

#define _T7CON_TGATE_POSITION                    0x00000007
#define _T7CON_TGATE_MASK                        0x00000080
#define _T7CON_TGATE_LENGTH                      0x00000001

#define _T7CON_SYNC_POSITION                     0x00000008
#define _T7CON_SYNC_MASK                         0x00000100
#define _T7CON_SYNC_LENGTH                       0x00000001

#define _T7CON_SIDL_POSITION                     0x0000000D
#define _T7CON_SIDL_MASK                         0x00002000
#define _T7CON_SIDL_LENGTH                       0x00000001

#define _T7CON_ON_POSITION                       0x0000000F
#define _T7CON_ON_MASK                           0x00008000
#define _T7CON_ON_LENGTH                         0x00000001

#define _T8CON_TCS_POSITION                      0x00000001
#define _T8CON_TCS_MASK                          0x00000002
#define _T8CON_TCS_LENGTH                        0x00000001

#define _T8CON_T32_POSITION                      0x00000003
#define _T8CON_T32_MASK                          0x00000008
#define _T8CON_T32_LENGTH                        0x00000001

#define _T8CON_TCKPS_POSITION                    0x00000004
#define _T8CON_TCKPS_MASK                        0x00000070
#define _T8CON_TCKPS_LENGTH                      0x00000003

#define _T8CON_TGATE_POSITION                    0x00000007
#define _T8CON_TGATE_MASK                        0x00000080
#define _T8CON_TGATE_LENGTH                      0x00000001

#define _T8CON_SYNC_POSITION                     0x00000008
#define _T8CON_SYNC_MASK                         0x00000100
#define _T8CON_SYNC_LENGTH                       0x00000001

#define _T8CON_SIDL_POSITION                     0x0000000D
#define _T8CON_SIDL_MASK                         0x00002000
#define _T8CON_SIDL_LENGTH                       0x00000001

#define _T8CON_ON_POSITION                       0x0000000F
#define _T8CON_ON_MASK                           0x00008000
#define _T8CON_ON_LENGTH                         0x00000001

#define _T9CON_TCS_POSITION                      0x00000001
#define _T9CON_TCS_MASK                          0x00000002
#define _T9CON_TCS_LENGTH                        0x00000001

#define _T9CON_T32_POSITION                      0x00000003
#define _T9CON_T32_MASK                          0x00000008
#define _T9CON_T32_LENGTH                        0x00000001

#define _T9CON_TCKPS_POSITION                    0x00000004
#define _T9CON_TCKPS_MASK                        0x00000070
#define _T9CON_TCKPS_LENGTH                      0x00000003

#define _T9CON_TGATE_POSITION                    0x00000007
#define _T9CON_TGATE_MASK                        0x00000080
#define _T9CON_TGATE_LENGTH                      0x00000001

#define _T9CON_SYNC_POSITION                     0x00000008
#define _T9CON_SYNC_MASK                         0x00000100
#define _T9CON_SYNC_LENGTH                       0x00000001

#define _T9CON_SIDL_POSITION                     0x0000000D
#define _T9CON_SIDL_MASK                         0x00002000
#define _T9CON_SIDL_LENGTH                       0x00000001

#define _T9CON_ON_POSITION                       0x0000000F
#define _T9CON_ON_MASK                           0x00008000
#define _T9CON_ON_LENGTH                         0x00000001

#define _IC1CON_ICM_POSITION                     0x00000000
#define _IC1CON_ICM_MASK                         0x00000007
#define _IC1CON_ICM_LENGTH                       0x00000003

#define _IC1CON_ICBNE_POSITION                   0x00000003
#define _IC1CON_ICBNE_MASK                       0x00000008
#define _IC1CON_ICBNE_LENGTH                     0x00000001

#define _IC1CON_ICOV_POSITION                    0x00000004
#define _IC1CON_ICOV_MASK                        0x00000010
#define _IC1CON_ICOV_LENGTH                      0x00000001

#define _IC1CON_ICI_POSITION                     0x00000005
#define _IC1CON_ICI_MASK                         0x00000060
#define _IC1CON_ICI_LENGTH                       0x00000002

#define _IC1CON_ICTMR_POSITION                   0x00000007
#define _IC1CON_ICTMR_MASK                       0x00000080
#define _IC1CON_ICTMR_LENGTH                     0x00000001

#define _IC1CON_C32_POSITION                     0x00000008
#define _IC1CON_C32_MASK                         0x00000100
#define _IC1CON_C32_LENGTH                       0x00000001

#define _IC1CON_FEDGE_POSITION                   0x00000009
#define _IC1CON_FEDGE_MASK                       0x00000200
#define _IC1CON_FEDGE_LENGTH                     0x00000001

#define _IC1CON_SIDL_POSITION                    0x0000000D
#define _IC1CON_SIDL_MASK                        0x00002000
#define _IC1CON_SIDL_LENGTH                      0x00000001

#define _IC1CON_ON_POSITION                      0x0000000F
#define _IC1CON_ON_MASK                          0x00008000
#define _IC1CON_ON_LENGTH                        0x00000001

#define _IC1CON_ICM0_POSITION                    0x00000000
#define _IC1CON_ICM0_MASK                        0x00000001
#define _IC1CON_ICM0_LENGTH                      0x00000001

#define _IC1CON_ICM1_POSITION                    0x00000001
#define _IC1CON_ICM1_MASK                        0x00000002
#define _IC1CON_ICM1_LENGTH                      0x00000001

#define _IC1CON_ICM2_POSITION                    0x00000002
#define _IC1CON_ICM2_MASK                        0x00000004
#define _IC1CON_ICM2_LENGTH                      0x00000001

#define _IC1CON_ICI0_POSITION                    0x00000005
#define _IC1CON_ICI0_MASK                        0x00000020
#define _IC1CON_ICI0_LENGTH                      0x00000001

#define _IC1CON_ICI1_POSITION                    0x00000006
#define _IC1CON_ICI1_MASK                        0x00000040
#define _IC1CON_ICI1_LENGTH                      0x00000001

