Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _PWMCON6_TRGIEN_POSITION                 0x00000015
#define _PWMCON6_TRGIEN_MASK                     0x00200000
#define _PWMCON6_TRGIEN_LENGTH                   0x00000001

#define _PWMCON6_CLIEN_POSITION                  0x00000016
#define _PWMCON6_CLIEN_MASK                      0x00400000
#define _PWMCON6_CLIEN_LENGTH                    0x00000001

#define _PWMCON6_FLTIEN_POSITION                 0x00000017
#define _PWMCON6_FLTIEN_MASK                     0x00800000
#define _PWMCON6_FLTIEN_LENGTH                   0x00000001

#define _PWMCON6_PWMHIF_POSITION                 0x0000001B
#define _PWMCON6_PWMHIF_MASK                     0x08000000
#define _PWMCON6_PWMHIF_LENGTH                   0x00000001

#define _PWMCON6_PWMLIF_POSITION                 0x0000001C
#define _PWMCON6_PWMLIF_MASK                     0x10000000
#define _PWMCON6_PWMLIF_LENGTH                   0x00000001

#define _PWMCON6_TRGIF_POSITION                  0x0000001D
#define _PWMCON6_TRGIF_MASK                      0x20000000
#define _PWMCON6_TRGIF_LENGTH                    0x00000001

#define _PWMCON6_CLIF_POSITION                   0x0000001E
#define _PWMCON6_CLIF_MASK                       0x40000000
#define _PWMCON6_CLIF_LENGTH                     0x00000001

#define _PWMCON6_FLTIF_POSITION                  0x0000001F
#define _PWMCON6_FLTIF_MASK                      0x80000000
#define _PWMCON6_FLTIF_LENGTH                    0x00000001

#define _IOCON6_OSYNC_POSITION                   0x00000000
#define _IOCON6_OSYNC_MASK                       0x00000001
#define _IOCON6_OSYNC_LENGTH                     0x00000001

#define _IOCON6_SWAP_POSITION                    0x00000001
#define _IOCON6_SWAP_MASK                        0x00000002
#define _IOCON6_SWAP_LENGTH                      0x00000001

#define _IOCON6_CLDAT_POSITION                   0x00000002
#define _IOCON6_CLDAT_MASK                       0x0000000C
#define _IOCON6_CLDAT_LENGTH                     0x00000002

#define _IOCON6_FLTDAT_POSITION                  0x00000004
#define _IOCON6_FLTDAT_MASK                      0x00000030
#define _IOCON6_FLTDAT_LENGTH                    0x00000002

#define _IOCON6_OVRDAT_POSITION                  0x00000006
#define _IOCON6_OVRDAT_MASK                      0x000000C0
#define _IOCON6_OVRDAT_LENGTH                    0x00000002

#define _IOCON6_OVRENL_POSITION                  0x00000008
#define _IOCON6_OVRENL_MASK                      0x00000100
#define _IOCON6_OVRENL_LENGTH                    0x00000001

#define _IOCON6_OVRENH_POSITION                  0x00000009
#define _IOCON6_OVRENH_MASK                      0x00000200
#define _IOCON6_OVRENH_LENGTH                    0x00000001

#define _IOCON6_PMOD_POSITION                    0x0000000A
#define _IOCON6_PMOD_MASK                        0x00000C00
#define _IOCON6_PMOD_LENGTH                      0x00000002

#define _IOCON6_POLL_POSITION                    0x0000000C
#define _IOCON6_POLL_MASK                        0x00001000
#define _IOCON6_POLL_LENGTH                      0x00000001

#define _IOCON6_POLH_POSITION                    0x0000000D
#define _IOCON6_POLH_MASK                        0x00002000
#define _IOCON6_POLH_LENGTH                      0x00000001

#define _IOCON6_PENL_POSITION                    0x0000000E
#define _IOCON6_PENL_MASK                        0x00004000
#define _IOCON6_PENL_LENGTH                      0x00000001

#define _IOCON6_PENH_POSITION                    0x0000000F
#define _IOCON6_PENH_MASK                        0x00008000
#define _IOCON6_PENH_LENGTH                      0x00000001

#define _IOCON6_FLTMOD_POSITION                  0x00000010
#define _IOCON6_FLTMOD_MASK                      0x00030000
#define _IOCON6_FLTMOD_LENGTH                    0x00000002

#define _IOCON6_FLTPOL_POSITION                  0x00000012
#define _IOCON6_FLTPOL_MASK                      0x00040000
#define _IOCON6_FLTPOL_LENGTH                    0x00000001

#define _IOCON6_FLTSRC_POSITION                  0x00000013
#define _IOCON6_FLTSRC_MASK                      0x00780000
#define _IOCON6_FLTSRC_LENGTH                    0x00000004

#define _IOCON6_CLMOD_POSITION                   0x00000018
#define _IOCON6_CLMOD_MASK                       0x01000000
#define _IOCON6_CLMOD_LENGTH                     0x00000001

#define _IOCON6_CLPOL_POSITION                   0x00000019
#define _IOCON6_CLPOL_MASK                       0x02000000
#define _IOCON6_CLPOL_LENGTH                     0x00000001

#define _IOCON6_CLSRC_POSITION                   0x0000001A
#define _IOCON6_CLSRC_MASK                       0x3C000000
#define _IOCON6_CLSRC_LENGTH                     0x00000004

#define _PDC6_PDC_POSITION                       0x00000000
#define _PDC6_PDC_MASK                           0x0000FFFF
#define _PDC6_PDC_LENGTH                         0x00000010

#define _SDC6_SDC_POSITION                       0x00000000
#define _SDC6_SDC_MASK                           0x0000FFFF
#define _SDC6_SDC_LENGTH                         0x00000010

#define _PHASE6_PHASE_POSITION                   0x00000000
#define _PHASE6_PHASE_MASK                       0x0000FFFF
#define _PHASE6_PHASE_LENGTH                     0x00000010

#define _DTR6_DTR_POSITION                       0x00000000
#define _DTR6_DTR_MASK                           0x0000FFFF
#define _DTR6_DTR_LENGTH                         0x00000010

#define _ALTDTR6_ALTDTR_POSITION                 0x00000000
#define _ALTDTR6_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR6_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP6_COMP_POSITION                   0x00000000
#define _DTCOMP6_COMP_MASK                       0x00003FFF
#define _DTCOMP6_COMP_LENGTH                     0x0000000E

#define _TRIG6_TRGCMP_POSITION                   0x00000000
#define _TRIG6_TRGCMP_MASK                       0x0000FFFF
#define _TRIG6_TRGCMP_LENGTH                     0x00000010

#define _TRGCON6_STRGIS_POSITION                 0x00000006
#define _TRGCON6_STRGIS_MASK                     0x00000040
#define _TRGCON6_STRGIS_LENGTH                   0x00000001

