Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _IOCON8_OVRENH_POSITION                  0x00000009
#define _IOCON8_OVRENH_MASK                      0x00000200
#define _IOCON8_OVRENH_LENGTH                    0x00000001

#define _IOCON8_PMOD_POSITION                    0x0000000A
#define _IOCON8_PMOD_MASK                        0x00000C00
#define _IOCON8_PMOD_LENGTH                      0x00000002

#define _IOCON8_POLL_POSITION                    0x0000000C
#define _IOCON8_POLL_MASK                        0x00001000
#define _IOCON8_POLL_LENGTH                      0x00000001

#define _IOCON8_POLH_POSITION                    0x0000000D
#define _IOCON8_POLH_MASK                        0x00002000
#define _IOCON8_POLH_LENGTH                      0x00000001

#define _IOCON8_PENL_POSITION                    0x0000000E
#define _IOCON8_PENL_MASK                        0x00004000
#define _IOCON8_PENL_LENGTH                      0x00000001

#define _IOCON8_PENH_POSITION                    0x0000000F
#define _IOCON8_PENH_MASK                        0x00008000
#define _IOCON8_PENH_LENGTH                      0x00000001

#define _IOCON8_FLTMOD_POSITION                  0x00000010
#define _IOCON8_FLTMOD_MASK                      0x00030000
#define _IOCON8_FLTMOD_LENGTH                    0x00000002

#define _IOCON8_FLTPOL_POSITION                  0x00000012
#define _IOCON8_FLTPOL_MASK                      0x00040000
#define _IOCON8_FLTPOL_LENGTH                    0x00000001

#define _IOCON8_FLTSRC_POSITION                  0x00000013
#define _IOCON8_FLTSRC_MASK                      0x00780000
#define _IOCON8_FLTSRC_LENGTH                    0x00000004

#define _IOCON8_CLMOD_POSITION                   0x00000018
#define _IOCON8_CLMOD_MASK                       0x01000000
#define _IOCON8_CLMOD_LENGTH                     0x00000001

#define _IOCON8_CLPOL_POSITION                   0x00000019
#define _IOCON8_CLPOL_MASK                       0x02000000
#define _IOCON8_CLPOL_LENGTH                     0x00000001

#define _IOCON8_CLSRC_POSITION                   0x0000001A
#define _IOCON8_CLSRC_MASK                       0x3C000000
#define _IOCON8_CLSRC_LENGTH                     0x00000004

#define _PDC8_PDC_POSITION                       0x00000000
#define _PDC8_PDC_MASK                           0x0000FFFF
#define _PDC8_PDC_LENGTH                         0x00000010

#define _SDC8_SDC_POSITION                       0x00000000
#define _SDC8_SDC_MASK                           0x0000FFFF
#define _SDC8_SDC_LENGTH                         0x00000010

#define _PHASE8_PHASE_POSITION                   0x00000000
#define _PHASE8_PHASE_MASK                       0x0000FFFF
#define _PHASE8_PHASE_LENGTH                     0x00000010

#define _DTR8_DTR_POSITION                       0x00000000
#define _DTR8_DTR_MASK                           0x0000FFFF
#define _DTR8_DTR_LENGTH                         0x00000010

#define _ALTDTR8_ALTDTR_POSITION                 0x00000000
#define _ALTDTR8_ALTDTR_MASK                     0x0000FFFF
#define _ALTDTR8_ALTDTR_LENGTH                   0x00000010

#define _DTCOMP8_COMP_POSITION                   0x00000000
#define _DTCOMP8_COMP_MASK                       0x00003FFF
#define _DTCOMP8_COMP_LENGTH                     0x0000000E

#define _TRIG8_TRGCMP_POSITION                   0x00000000
#define _TRIG8_TRGCMP_MASK                       0x0000FFFF
#define _TRIG8_TRGCMP_LENGTH                     0x00000010

#define _TRGCON8_STRGIS_POSITION                 0x00000006
#define _TRGCON8_STRGIS_MASK                     0x00000040
#define _TRGCON8_STRGIS_LENGTH                   0x00000001

#define _TRGCON8_DTM_POSITION                    0x00000007
#define _TRGCON8_DTM_MASK                        0x00000080
#define _TRGCON8_DTM_LENGTH                      0x00000001

#define _TRGCON8_STRGSEL_POSITION                0x00000008
#define _TRGCON8_STRGSEL_MASK                    0x00000300
#define _TRGCON8_STRGSEL_LENGTH                  0x00000002

#define _TRGCON8_TRGSEL_POSITION                 0x0000000A
#define _TRGCON8_TRGSEL_MASK                     0x00000C00
#define _TRGCON8_TRGSEL_LENGTH                   0x00000002

#define _TRGCON8_TRGDIV_POSITION                 0x0000000C
#define _TRGCON8_TRGDIV_MASK                     0x0000F000
#define _TRGCON8_TRGDIV_LENGTH                   0x00000004

#define _STRIG8_STRGCMP_POSITION                 0x00000000
#define _STRIG8_STRGCMP_MASK                     0x0000FFFF
#define _STRIG8_STRGCMP_LENGTH                   0x00000010

#define _CAP8_CAP_POSITION                       0x00000000
#define _CAP8_CAP_MASK                           0x0000FFFF
#define _CAP8_CAP_LENGTH                         0x00000010

#define _LEBCON8_CLLEBEN_POSITION                0x0000000A
#define _LEBCON8_CLLEBEN_MASK                    0x00000400
#define _LEBCON8_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON8_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON8_FLTLEBEN_MASK                   0x00000800
#define _LEBCON8_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON8_PLF_POSITION                    0x0000000C
#define _LEBCON8_PLF_MASK                        0x00001000
#define _LEBCON8_PLF_LENGTH                      0x00000001

#define _LEBCON8_PLR_POSITION                    0x0000000D
#define _LEBCON8_PLR_MASK                        0x00002000
#define _LEBCON8_PLR_LENGTH                      0x00000001

#define _LEBCON8_PHF_POSITION                    0x0000000E
#define _LEBCON8_PHF_MASK                        0x00004000
#define _LEBCON8_PHF_LENGTH                      0x00000001

#define _LEBCON8_PHR_POSITION                    0x0000000F
#define _LEBCON8_PHR_MASK                        0x00008000
#define _LEBCON8_PHR_LENGTH                      0x00000001

#define _LEBDLY8_LEB_POSITION                    0x00000000
#define _LEBDLY8_LEB_MASK                        0x00000FFF
#define _LEBDLY8_LEB_LENGTH                      0x0000000C

#define _AUXCON8_CHOPLEN_POSITION                0x00000000
#define _AUXCON8_CHOPLEN_MASK                    0x00000001
#define _AUXCON8_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON8_CHOPHEN_POSITION                0x00000001
#define _AUXCON8_CHOPHEN_MASK                    0x00000002
#define _AUXCON8_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON8_CHOPSEL_POSITION                0x00000002
#define _AUXCON8_CHOPSEL_MASK                    0x0000003C
#define _AUXCON8_CHOPSEL_LENGTH                  0x00000004

