Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _IOCON12_FLTPOL_POSITION                 0x00000012
#define _IOCON12_FLTPOL_MASK                     0x00040000
#define _IOCON12_FLTPOL_LENGTH                   0x00000001

#define _IOCON12_FLTSRC_POSITION                 0x00000013
#define _IOCON12_FLTSRC_MASK                     0x00780000
#define _IOCON12_FLTSRC_LENGTH                   0x00000004

#define _IOCON12_CLMOD_POSITION                  0x00000018
#define _IOCON12_CLMOD_MASK                      0x01000000
#define _IOCON12_CLMOD_LENGTH                    0x00000001

#define _IOCON12_CLPOL_POSITION                  0x00000019
#define _IOCON12_CLPOL_MASK                      0x02000000
#define _IOCON12_CLPOL_LENGTH                    0x00000001

#define _IOCON12_CLSRC_POSITION                  0x0000001A
#define _IOCON12_CLSRC_MASK                      0x3C000000
#define _IOCON12_CLSRC_LENGTH                    0x00000004

#define _PDC12_PDC_POSITION                      0x00000000
#define _PDC12_PDC_MASK                          0x0000FFFF
#define _PDC12_PDC_LENGTH                        0x00000010

#define _SDC12_SDC_POSITION                      0x00000000
#define _SDC12_SDC_MASK                          0x0000FFFF
#define _SDC12_SDC_LENGTH                        0x00000010

#define _PHASE12_PHASE_POSITION                  0x00000000
#define _PHASE12_PHASE_MASK                      0x0000FFFF
#define _PHASE12_PHASE_LENGTH                    0x00000010

#define _DTR12_DTR_POSITION                      0x00000000
#define _DTR12_DTR_MASK                          0x0000FFFF
#define _DTR12_DTR_LENGTH                        0x00000010

#define _ALTDTR12_ALTDTR_POSITION                0x00000000
#define _ALTDTR12_ALTDTR_MASK                    0x0000FFFF
#define _ALTDTR12_ALTDTR_LENGTH                  0x00000010

#define _DTCOMP12_COMP_POSITION                  0x00000000
#define _DTCOMP12_COMP_MASK                      0x00003FFF
#define _DTCOMP12_COMP_LENGTH                    0x0000000E

#define _TRIG12_TRGCMP_POSITION                  0x00000000
#define _TRIG12_TRGCMP_MASK                      0x0000FFFF
#define _TRIG12_TRGCMP_LENGTH                    0x00000010

#define _TRGCON12_STRGIS_POSITION                0x00000006
#define _TRGCON12_STRGIS_MASK                    0x00000040
#define _TRGCON12_STRGIS_LENGTH                  0x00000001

#define _TRGCON12_DTM_POSITION                   0x00000007
#define _TRGCON12_DTM_MASK                       0x00000080
#define _TRGCON12_DTM_LENGTH                     0x00000001

#define _TRGCON12_STRGSEL_POSITION               0x00000008
#define _TRGCON12_STRGSEL_MASK                   0x00000300
#define _TRGCON12_STRGSEL_LENGTH                 0x00000002

#define _TRGCON12_TRGSEL_POSITION                0x0000000A
#define _TRGCON12_TRGSEL_MASK                    0x00000C00
#define _TRGCON12_TRGSEL_LENGTH                  0x00000002

#define _TRGCON12_TRGDIV_POSITION                0x0000000C
#define _TRGCON12_TRGDIV_MASK                    0x0000F000
#define _TRGCON12_TRGDIV_LENGTH                  0x00000004

#define _STRIG12_STRGCMP_POSITION                0x00000000
#define _STRIG12_STRGCMP_MASK                    0x0000FFFF
#define _STRIG12_STRGCMP_LENGTH                  0x00000010

#define _CAP12_CAP_POSITION                      0x00000000
#define _CAP12_CAP_MASK                          0x0000FFFF
#define _CAP12_CAP_LENGTH                        0x00000010

#define _LEBCON12_CLLEBEN_POSITION               0x0000000A
#define _LEBCON12_CLLEBEN_MASK                   0x00000400
#define _LEBCON12_CLLEBEN_LENGTH                 0x00000001

#define _LEBCON12_FLTLEBEN_POSITION              0x0000000B
#define _LEBCON12_FLTLEBEN_MASK                  0x00000800
#define _LEBCON12_FLTLEBEN_LENGTH                0x00000001

#define _LEBCON12_PLF_POSITION                   0x0000000C
#define _LEBCON12_PLF_MASK                       0x00001000
#define _LEBCON12_PLF_LENGTH                     0x00000001

#define _LEBCON12_PLR_POSITION                   0x0000000D
#define _LEBCON12_PLR_MASK                       0x00002000
#define _LEBCON12_PLR_LENGTH                     0x00000001

#define _LEBCON12_PHF_POSITION                   0x0000000E
#define _LEBCON12_PHF_MASK                       0x00004000
#define _LEBCON12_PHF_LENGTH                     0x00000001

#define _LEBCON12_PHR_POSITION                   0x0000000F
#define _LEBCON12_PHR_MASK                       0x00008000
#define _LEBCON12_PHR_LENGTH                     0x00000001

#define _LEBDLY12_LEB_POSITION                   0x00000000
#define _LEBDLY12_LEB_MASK                       0x00000FFF
#define _LEBDLY12_LEB_LENGTH                     0x0000000C

#define _AUXCON12_CHOPLEN_POSITION               0x00000000
#define _AUXCON12_CHOPLEN_MASK                   0x00000001
#define _AUXCON12_CHOPLEN_LENGTH                 0x00000001

#define _AUXCON12_CHOPHEN_POSITION               0x00000001
#define _AUXCON12_CHOPHEN_MASK                   0x00000002
#define _AUXCON12_CHOPHEN_LENGTH                 0x00000001

#define _AUXCON12_CHOPSEL_POSITION               0x00000002
#define _AUXCON12_CHOPSEL_MASK                   0x0000003C
#define _AUXCON12_CHOPSEL_LENGTH                 0x00000004

#define _PTMR12_TMR_POSITION                     0x00000000
#define _PTMR12_TMR_MASK                         0x0000FFFF
#define _PTMR12_TMR_LENGTH                       0x00000010

#define _PTGCON_PTGITM_POSITION                  0x00000000
#define _PTGCON_PTGITM_MASK                      0x00000003
#define _PTGCON_PTGITM_LENGTH                    0x00000002

#define _PTGCON_PTGBUSY_POSITION                 0x00000005
#define _PTGCON_PTGBUSY_MASK                     0x00000020
#define _PTGCON_PTGBUSY_LENGTH                   0x00000001

#define _PTGCON_PTGWDTO_POSITION                 0x00000006
#define _PTGCON_PTGWDTO_MASK                     0x00000040
#define _PTGCON_PTGWDTO_LENGTH                   0x00000001

#define _PTGCON_PTGSTRT_POSITION                 0x00000007
#define _PTGCON_PTGSTRT_MASK                     0x00000080
#define _PTGCON_PTGSTRT_LENGTH                   0x00000001

#define _PTGCON_PTGIVIS_POSITION                 0x00000008
#define _PTGCON_PTGIVIS_MASK                     0x00000100
#define _PTGCON_PTGIVIS_LENGTH                   0x00000001

#define _PTGCON_PTGSSEN_POSITION                 0x00000009
#define _PTGCON_PTGSSEN_MASK                     0x00000200
#define _PTGCON_PTGSSEN_LENGTH                   0x00000001

#define _PTGCON_PTGSWT_POSITION                  0x0000000A
#define _PTGCON_PTGSWT_MASK                      0x00000400
#define _PTGCON_PTGSWT_LENGTH                    0x00000001

#define _PTGCON_RESERVED_POSITION                0x0000000B
#define _PTGCON_RESERVED_MASK                    0x00000800
#define _PTGCON_RESERVED_LENGTH                  0x00000001

