Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _PTGCON_PTGTOGL_POSITION                 0x0000000C
#define _PTGCON_PTGTOGL_MASK                     0x00001000
#define _PTGCON_PTGTOGL_LENGTH                   0x00000001

#define _PTGCON_PTGSIDL_POSITION                 0x0000000D
#define _PTGCON_PTGSIDL_MASK                     0x00002000
#define _PTGCON_PTGSIDL_LENGTH                   0x00000001

#define _PTGCON_PTGON_POSITION                   0x0000000F
#define _PTGCON_PTGON_MASK                       0x00008000
#define _PTGCON_PTGON_LENGTH                     0x00000001

#define _PTGCON_PTGWDT_POSITION                  0x00000010
#define _PTGCON_PTGWDT_MASK                      0x00070000
#define _PTGCON_PTGWDT_LENGTH                    0x00000003

#define _PTGCON_PTGPWD_POSITION                  0x00000014
#define _PTGCON_PTGPWD_MASK                      0x00F00000
#define _PTGCON_PTGPWD_LENGTH                    0x00000004

#define _PTGCON_PTGDIV_POSITION                  0x00000018
#define _PTGCON_PTGDIV_MASK                      0x1F000000
#define _PTGCON_PTGDIV_LENGTH                    0x00000005

#define _PTGCON_PTGCLK_POSITION                  0x0000001D
#define _PTGCON_PTGCLK_MASK                      0xE0000000
#define _PTGCON_PTGCLK_LENGTH                    0x00000003

#define _PTGBTE_PTGBTE_POSITION                  0x00000000
#define _PTGBTE_PTGBTE_MASK                      0xFFFFFFFF
#define _PTGBTE_PTGBTE_LENGTH                    0x00000020

#define _PTGHOLD_PTGHOLD_POSITION                0x00000000
#define _PTGHOLD_PTGHOLD_MASK                    0x0000FFFF
#define _PTGHOLD_PTGHOLD_LENGTH                  0x00000010

#define _PTGT0LIM_PTGT0LIM_POSITION              0x00000000
#define _PTGT0LIM_PTGT0LIM_MASK                  0x0000FFFF
#define _PTGT0LIM_PTGT0LIM_LENGTH                0x00000010

#define _PTGT1LIM_PTGT1LIM_POSITION              0x00000000
#define _PTGT1LIM_PTGT1LIM_MASK                  0x0000FFFF
#define _PTGT1LIM_PTGT1LIM_LENGTH                0x00000010

#define _PTGSDLIM_PTGSDLIM_POSITION              0x00000000
#define _PTGSDLIM_PTGSDLIM_MASK                  0x0000FFFF
#define _PTGSDLIM_PTGSDLIM_LENGTH                0x00000010

#define _PTGC0LIM_PTGC0LIM_POSITION              0x00000000
#define _PTGC0LIM_PTGC0LIM_MASK                  0x0000FFFF
#define _PTGC0LIM_PTGC0LIM_LENGTH                0x00000010

#define _PTGC1LIM_PTGC1LIM_POSITION              0x00000000
#define _PTGC1LIM_PTGC1LIM_MASK                  0x0000FFFF
#define _PTGC1LIM_PTGC1LIM_LENGTH                0x00000010

#define _PTGADJ_PTGADJ_POSITION                  0x00000000
#define _PTGADJ_PTGADJ_MASK                      0x0000FFFF
#define _PTGADJ_PTGADJ_LENGTH                    0x00000010

#define _PTGL0_PTGL0_POSITION                    0x00000000
#define _PTGL0_PTGL0_MASK                        0x0000FFFF
#define _PTGL0_PTGL0_LENGTH                      0x00000010

#define _PTGQPTR_PTGQPTR_POSITION                0x00000000
#define _PTGQPTR_PTGQPTR_MASK                    0x0000001F
#define _PTGQPTR_PTGQPTR_LENGTH                  0x00000005

#define _PTGQUE0_STEP0_POSITION                  0x00000000
#define _PTGQUE0_STEP0_MASK                      0x000000FF
#define _PTGQUE0_STEP0_LENGTH                    0x00000008

#define _PTGQUE0_STEP1_POSITION                  0x00000008
#define _PTGQUE0_STEP1_MASK                      0x0000FF00
#define _PTGQUE0_STEP1_LENGTH                    0x00000008

#define _PTGQUE0_STEP2_POSITION                  0x00000010
#define _PTGQUE0_STEP2_MASK                      0x00FF0000
#define _PTGQUE0_STEP2_LENGTH                    0x00000008

#define _PTGQUE0_STEP3_POSITION                  0x00000018
#define _PTGQUE0_STEP3_MASK                      0xFF000000
#define _PTGQUE0_STEP3_LENGTH                    0x00000008

#define _PTGQUE1_STEP4_POSITION                  0x00000000
#define _PTGQUE1_STEP4_MASK                      0x000000FF
#define _PTGQUE1_STEP4_LENGTH                    0x00000008

#define _PTGQUE1_STEP5_POSITION                  0x00000008
#define _PTGQUE1_STEP5_MASK                      0x0000FF00
#define _PTGQUE1_STEP5_LENGTH                    0x00000008

#define _PTGQUE1_STEP6_POSITION                  0x00000010
#define _PTGQUE1_STEP6_MASK                      0x00FF0000
#define _PTGQUE1_STEP6_LENGTH                    0x00000008

#define _PTGQUE1_STEP7_POSITION                  0x00000018
#define _PTGQUE1_STEP7_MASK                      0xFF000000
#define _PTGQUE1_STEP7_LENGTH                    0x00000008

#define _PTGQUE2_STEP8_POSITION                  0x00000000
#define _PTGQUE2_STEP8_MASK                      0x000000FF
#define _PTGQUE2_STEP8_LENGTH                    0x00000008

#define _PTGQUE2_STEP9_POSITION                  0x00000008
#define _PTGQUE2_STEP9_MASK                      0x0000FF00
#define _PTGQUE2_STEP9_LENGTH                    0x00000008

#define _PTGQUE2_STEP10_POSITION                 0x00000010
#define _PTGQUE2_STEP10_MASK                     0x00FF0000
#define _PTGQUE2_STEP10_LENGTH                   0x00000008

#define _PTGQUE2_STEP11_POSITION                 0x00000018
#define _PTGQUE2_STEP11_MASK                     0xFF000000
#define _PTGQUE2_STEP11_LENGTH                   0x00000008

#define _PTGQUE3_STEP12_POSITION                 0x00000000
#define _PTGQUE3_STEP12_MASK                     0x000000FF
#define _PTGQUE3_STEP12_LENGTH                   0x00000008

#define _PTGQUE3_STEP13_POSITION                 0x00000008
#define _PTGQUE3_STEP13_MASK                     0x0000FF00
#define _PTGQUE3_STEP13_LENGTH                   0x00000008

#define _PTGQUE3_STEP14_POSITION                 0x00000010
#define _PTGQUE3_STEP14_MASK                     0x00FF0000
#define _PTGQUE3_STEP14_LENGTH                   0x00000008

#define _PTGQUE3_STEP15_POSITION                 0x00000018
#define _PTGQUE3_STEP15_MASK                     0xFF000000
#define _PTGQUE3_STEP15_LENGTH                   0x00000008

#define _PTGQUE4_STEP16_POSITION                 0x00000000
#define _PTGQUE4_STEP16_MASK                     0x000000FF
#define _PTGQUE4_STEP16_LENGTH                   0x00000008

#define _PTGQUE4_STEP17_POSITION                 0x00000008
#define _PTGQUE4_STEP17_MASK                     0x0000FF00
#define _PTGQUE4_STEP17_LENGTH                   0x00000008

#define _PTGQUE4_STEP18_POSITION                 0x00000010
#define _PTGQUE4_STEP18_MASK                     0x00FF0000
#define _PTGQUE4_STEP18_LENGTH                   0x00000008

