Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _OC15CON_OCM0_POSITION                   0x00000000
#define _OC15CON_OCM0_MASK                       0x00000001
#define _OC15CON_OCM0_LENGTH                     0x00000001

#define _OC15CON_OCM1_POSITION                   0x00000001
#define _OC15CON_OCM1_MASK                       0x00000002
#define _OC15CON_OCM1_LENGTH                     0x00000001

#define _OC15CON_OCM2_POSITION                   0x00000002
#define _OC15CON_OCM2_MASK                       0x00000004
#define _OC15CON_OCM2_LENGTH                     0x00000001

#define _OC15CON_OCSIDL_POSITION                 0x0000000D
#define _OC15CON_OCSIDL_MASK                     0x00002000
#define _OC15CON_OCSIDL_LENGTH                   0x00000001

#define _OC15CON_w_POSITION                      0x00000000
#define _OC15CON_w_MASK                          0xFFFFFFFF
#define _OC15CON_w_LENGTH                        0x00000020

#define _OC16CON_OCM_POSITION                    0x00000000
#define _OC16CON_OCM_MASK                        0x00000007
#define _OC16CON_OCM_LENGTH                      0x00000003

#define _OC16CON_OCTSEL_POSITION                 0x00000003
#define _OC16CON_OCTSEL_MASK                     0x00000008
#define _OC16CON_OCTSEL_LENGTH                   0x00000001

#define _OC16CON_OCFLT_POSITION                  0x00000004
#define _OC16CON_OCFLT_MASK                      0x00000010
#define _OC16CON_OCFLT_LENGTH                    0x00000001

#define _OC16CON_OC32_POSITION                   0x00000005
#define _OC16CON_OC32_MASK                       0x00000020
#define _OC16CON_OC32_LENGTH                     0x00000001

#define _OC16CON_SIDL_POSITION                   0x0000000D
#define _OC16CON_SIDL_MASK                       0x00002000
#define _OC16CON_SIDL_LENGTH                     0x00000001

#define _OC16CON_ON_POSITION                     0x0000000F
#define _OC16CON_ON_MASK                         0x00008000
#define _OC16CON_ON_LENGTH                       0x00000001

#define _OC16CON_OCM0_POSITION                   0x00000000
#define _OC16CON_OCM0_MASK                       0x00000001
#define _OC16CON_OCM0_LENGTH                     0x00000001

#define _OC16CON_OCM1_POSITION                   0x00000001
#define _OC16CON_OCM1_MASK                       0x00000002
#define _OC16CON_OCM1_LENGTH                     0x00000001

#define _OC16CON_OCM2_POSITION                   0x00000002
#define _OC16CON_OCM2_MASK                       0x00000004
#define _OC16CON_OCM2_LENGTH                     0x00000001

#define _OC16CON_OCSIDL_POSITION                 0x0000000D
#define _OC16CON_OCSIDL_MASK                     0x00002000
#define _OC16CON_OCSIDL_LENGTH                   0x00000001

#define _OC16CON_w_POSITION                      0x00000000
#define _OC16CON_w_MASK                          0xFFFFFFFF
#define _OC16CON_w_LENGTH                        0x00000020

#define _I2C3CON_SEN_POSITION                    0x00000000
#define _I2C3CON_SEN_MASK                        0x00000001
#define _I2C3CON_SEN_LENGTH                      0x00000001

#define _I2C3CON_RSEN_POSITION                   0x00000001
#define _I2C3CON_RSEN_MASK                       0x00000002
#define _I2C3CON_RSEN_LENGTH                     0x00000001

#define _I2C3CON_PEN_POSITION                    0x00000002
#define _I2C3CON_PEN_MASK                        0x00000004
#define _I2C3CON_PEN_LENGTH                      0x00000001

#define _I2C3CON_RCEN_POSITION                   0x00000003
#define _I2C3CON_RCEN_MASK                       0x00000008
#define _I2C3CON_RCEN_LENGTH                     0x00000001

#define _I2C3CON_ACKEN_POSITION                  0x00000004
#define _I2C3CON_ACKEN_MASK                      0x00000010
#define _I2C3CON_ACKEN_LENGTH                    0x00000001

#define _I2C3CON_ACKDT_POSITION                  0x00000005
#define _I2C3CON_ACKDT_MASK                      0x00000020
#define _I2C3CON_ACKDT_LENGTH                    0x00000001

#define _I2C3CON_STREN_POSITION                  0x00000006
#define _I2C3CON_STREN_MASK                      0x00000040
#define _I2C3CON_STREN_LENGTH                    0x00000001

#define _I2C3CON_GCEN_POSITION                   0x00000007
#define _I2C3CON_GCEN_MASK                       0x00000080
#define _I2C3CON_GCEN_LENGTH                     0x00000001

#define _I2C3CON_SMEN_POSITION                   0x00000008
#define _I2C3CON_SMEN_MASK                       0x00000100
#define _I2C3CON_SMEN_LENGTH                     0x00000001

#define _I2C3CON_DISSLW_POSITION                 0x00000009
#define _I2C3CON_DISSLW_MASK                     0x00000200
#define _I2C3CON_DISSLW_LENGTH                   0x00000001

#define _I2C3CON_A10M_POSITION                   0x0000000A
#define _I2C3CON_A10M_MASK                       0x00000400
#define _I2C3CON_A10M_LENGTH                     0x00000001

#define _I2C3CON_STRICT_POSITION                 0x0000000B
#define _I2C3CON_STRICT_MASK                     0x00000800
#define _I2C3CON_STRICT_LENGTH                   0x00000001

#define _I2C3CON_SCLREL_POSITION                 0x0000000C
#define _I2C3CON_SCLREL_MASK                     0x00001000
#define _I2C3CON_SCLREL_LENGTH                   0x00000001

#define _I2C3CON_SIDL_POSITION                   0x0000000D
#define _I2C3CON_SIDL_MASK                       0x00002000
#define _I2C3CON_SIDL_LENGTH                     0x00000001

#define _I2C3CON_ON_POSITION                     0x0000000F
#define _I2C3CON_ON_MASK                         0x00008000
#define _I2C3CON_ON_LENGTH                       0x00000001

#define _I2C3CON_DHEN_POSITION                   0x00000010
#define _I2C3CON_DHEN_MASK                       0x00010000
#define _I2C3CON_DHEN_LENGTH                     0x00000001

#define _I2C3CON_AHEN_POSITION                   0x00000011
#define _I2C3CON_AHEN_MASK                       0x00020000
#define _I2C3CON_AHEN_LENGTH                     0x00000001

#define _I2C3CON_SBCDE_POSITION                  0x00000012
#define _I2C3CON_SBCDE_MASK                      0x00040000
#define _I2C3CON_SBCDE_LENGTH                    0x00000001

#define _I2C3CON_SDAHT_POSITION                  0x00000013
#define _I2C3CON_SDAHT_MASK                      0x00080000
#define _I2C3CON_SDAHT_LENGTH                    0x00000001

#define _I2C3CON_BOEN_POSITION                   0x00000014
#define _I2C3CON_BOEN_MASK                       0x00100000
#define _I2C3CON_BOEN_LENGTH                     0x00000001

#define _I2C3CON_SCIE_POSITION                   0x00000015
#define _I2C3CON_SCIE_MASK                       0x00200000
#define _I2C3CON_SCIE_LENGTH                     0x00000001

#define _I2C3CON_PCIE_POSITION                   0x00000016
#define _I2C3CON_PCIE_MASK                       0x00400000
#define _I2C3CON_PCIE_LENGTH                     0x00000001

#define _I2C3CON_IPMIEN_POSITION                 0x0000000B
#define _I2C3CON_IPMIEN_MASK                     0x00000800
#define _I2C3CON_IPMIEN_LENGTH                   0x00000001

#define _I2C3CON_I2CSIDL_POSITION                0x0000000D
#define _I2C3CON_I2CSIDL_MASK                    0x00002000
#define _I2C3CON_I2CSIDL_LENGTH                  0x00000001

#define _I2C3CON_I2CEN_POSITION                  0x0000000F
#define _I2C3CON_I2CEN_MASK                      0x00008000
#define _I2C3CON_I2CEN_LENGTH                    0x00000001

