Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _CNNEA_CNNEA14_POSITION                  0x0000000E
#define _CNNEA_CNNEA14_MASK                      0x00004000
#define _CNNEA_CNNEA14_LENGTH                    0x00000001

#define _CNNEA_CNNEA15_POSITION                  0x0000000F
#define _CNNEA_CNNEA15_MASK                      0x00008000
#define _CNNEA_CNNEA15_LENGTH                    0x00000001

#define _CNFA_CNFA0_POSITION                     0x00000000
#define _CNFA_CNFA0_MASK                         0x00000001
#define _CNFA_CNFA0_LENGTH                       0x00000001

#define _CNFA_CNFA1_POSITION                     0x00000001
#define _CNFA_CNFA1_MASK                         0x00000002
#define _CNFA_CNFA1_LENGTH                       0x00000001

#define _CNFA_CNFA4_POSITION                     0x00000004
#define _CNFA_CNFA4_MASK                         0x00000010
#define _CNFA_CNFA4_LENGTH                       0x00000001

#define _CNFA_CNFA7_POSITION                     0x00000007
#define _CNFA_CNFA7_MASK                         0x00000080
#define _CNFA_CNFA7_LENGTH                       0x00000001

#define _CNFA_CNFA8_POSITION                     0x00000008
#define _CNFA_CNFA8_MASK                         0x00000100
#define _CNFA_CNFA8_LENGTH                       0x00000001

#define _CNFA_CNFA10_POSITION                    0x0000000A
#define _CNFA_CNFA10_MASK                        0x00000400
#define _CNFA_CNFA10_LENGTH                      0x00000001

#define _CNFA_CNFA11_POSITION                    0x0000000B
#define _CNFA_CNFA11_MASK                        0x00000800
#define _CNFA_CNFA11_LENGTH                      0x00000001

#define _CNFA_CNFA12_POSITION                    0x0000000C
#define _CNFA_CNFA12_MASK                        0x00001000
#define _CNFA_CNFA12_LENGTH                      0x00000001

#define _CNFA_CNFA14_POSITION                    0x0000000E
#define _CNFA_CNFA14_MASK                        0x00004000
#define _CNFA_CNFA14_LENGTH                      0x00000001

#define _CNFA_CNFA15_POSITION                    0x0000000F
#define _CNFA_CNFA15_MASK                        0x00008000
#define _CNFA_CNFA15_LENGTH                      0x00000001

#define _SRCON0A_SR0A7_POSITION                  0x00000007
#define _SRCON0A_SR0A7_MASK                      0x00000080
#define _SRCON0A_SR0A7_LENGTH                    0x00000001

#define _SRCON0A_SR0A8_POSITION                  0x00000008
#define _SRCON0A_SR0A8_MASK                      0x00000100
#define _SRCON0A_SR0A8_LENGTH                    0x00000001

#define _SRCON0A_SR0A10_POSITION                 0x0000000A
#define _SRCON0A_SR0A10_MASK                     0x00000400
#define _SRCON0A_SR0A10_LENGTH                   0x00000001

#define _SRCON1A_SR1A7_POSITION                  0x00000007
#define _SRCON1A_SR1A7_MASK                      0x00000080
#define _SRCON1A_SR1A7_LENGTH                    0x00000001

#define _SRCON1A_SR1A8_POSITION                  0x00000008
#define _SRCON1A_SR1A8_MASK                      0x00000100
#define _SRCON1A_SR1A8_LENGTH                    0x00000001

#define _SRCON1A_SR1A10_POSITION                 0x0000000A
#define _SRCON1A_SR1A10_MASK                     0x00000400
#define _SRCON1A_SR1A10_LENGTH                   0x00000001

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

#define _ANSELB_ANSB3_POSITION                   0x00000003
#define _ANSELB_ANSB3_MASK                       0x00000008
#define _ANSELB_ANSB3_LENGTH                     0x00000001

#define _ANSELB_ANSB7_POSITION                   0x00000007
#define _ANSELB_ANSB7_MASK                       0x00000080
#define _ANSELB_ANSB7_LENGTH                     0x00000001

#define _ANSELB_ANSB9_POSITION                   0x00000009
#define _ANSELB_ANSB9_MASK                       0x00000200
#define _ANSELB_ANSB9_LENGTH                     0x00000001

#define _ANSELB_w_POSITION                       0x00000000
#define _ANSELB_w_MASK                           0xFFFFFFFF
#define _ANSELB_w_LENGTH                         0x00000020

#define _TRISB_TRISB0_POSITION                   0x00000000
#define _TRISB_TRISB0_MASK                       0x00000001
#define _TRISB_TRISB0_LENGTH                     0x00000001

#define _TRISB_TRISB1_POSITION                   0x00000001
#define _TRISB_TRISB1_MASK                       0x00000002
#define _TRISB_TRISB1_LENGTH                     0x00000001

#define _TRISB_TRISB2_POSITION                   0x00000002
#define _TRISB_TRISB2_MASK                       0x00000004
#define _TRISB_TRISB2_LENGTH                     0x00000001

#define _TRISB_TRISB3_POSITION                   0x00000003
#define _TRISB_TRISB3_MASK                       0x00000008
#define _TRISB_TRISB3_LENGTH                     0x00000001

#define _TRISB_TRISB4_POSITION                   0x00000004
#define _TRISB_TRISB4_MASK                       0x00000010
#define _TRISB_TRISB4_LENGTH                     0x00000001

#define _TRISB_TRISB5_POSITION                   0x00000005
#define _TRISB_TRISB5_MASK                       0x00000020
#define _TRISB_TRISB5_LENGTH                     0x00000001

#define _TRISB_TRISB6_POSITION                   0x00000006
#define _TRISB_TRISB6_MASK                       0x00000040
#define _TRISB_TRISB6_LENGTH                     0x00000001

#define _TRISB_TRISB7_POSITION                   0x00000007
#define _TRISB_TRISB7_MASK                       0x00000080
#define _TRISB_TRISB7_LENGTH                     0x00000001

#define _TRISB_TRISB8_POSITION                   0x00000008
#define _TRISB_TRISB8_MASK                       0x00000100
#define _TRISB_TRISB8_LENGTH                     0x00000001

#define _TRISB_TRISB9_POSITION                   0x00000009
#define _TRISB_TRISB9_MASK                       0x00000200
#define _TRISB_TRISB9_LENGTH                     0x00000001

#define _TRISB_TRISB10_POSITION                  0x0000000A
#define _TRISB_TRISB10_MASK                      0x00000400
#define _TRISB_TRISB10_LENGTH                    0x00000001

#define _TRISB_TRISB11_POSITION                  0x0000000B
#define _TRISB_TRISB11_MASK                      0x00000800
#define _TRISB_TRISB11_LENGTH                    0x00000001

