Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _CNSTATF_CNSTATF10_POSITION              0x0000000A
#define _CNSTATF_CNSTATF10_MASK                  0x00000400
#define _CNSTATF_CNSTATF10_LENGTH                0x00000001

#define _CNSTATF_CNSTATF12_POSITION              0x0000000C
#define _CNSTATF_CNSTATF12_MASK                  0x00001000
#define _CNSTATF_CNSTATF12_LENGTH                0x00000001

#define _CNSTATF_CNSTATF13_POSITION              0x0000000D
#define _CNSTATF_CNSTATF13_MASK                  0x00002000
#define _CNSTATF_CNSTATF13_LENGTH                0x00000001

#define _CNSTATF_w_POSITION                      0x00000000
#define _CNSTATF_w_MASK                          0xFFFFFFFF
#define _CNSTATF_w_LENGTH                        0x00000020

#define _CNNEF_CNNEF0_POSITION                   0x00000000
#define _CNNEF_CNNEF0_MASK                       0x00000001
#define _CNNEF_CNNEF0_LENGTH                     0x00000001

#define _CNNEF_CNNEF1_POSITION                   0x00000001
#define _CNNEF_CNNEF1_MASK                       0x00000002
#define _CNNEF_CNNEF1_LENGTH                     0x00000001

#define _CNNEF_CNNEF5_POSITION                   0x00000005
#define _CNNEF_CNNEF5_MASK                       0x00000020
#define _CNNEF_CNNEF5_LENGTH                     0x00000001

#define _CNNEF_CNNEF6_POSITION                   0x00000006
#define _CNNEF_CNNEF6_MASK                       0x00000040
#define _CNNEF_CNNEF6_LENGTH                     0x00000001

#define _CNNEF_CNNEF7_POSITION                   0x00000007
#define _CNNEF_CNNEF7_MASK                       0x00000080
#define _CNNEF_CNNEF7_LENGTH                     0x00000001

#define _CNNEF_CNNEF9_POSITION                   0x00000009
#define _CNNEF_CNNEF9_MASK                       0x00000200
#define _CNNEF_CNNEF9_LENGTH                     0x00000001

#define _CNNEF_CNNEF10_POSITION                  0x0000000A
#define _CNNEF_CNNEF10_MASK                      0x00000400
#define _CNNEF_CNNEF10_LENGTH                    0x00000001

#define _CNNEF_CNNEF12_POSITION                  0x0000000C
#define _CNNEF_CNNEF12_MASK                      0x00001000
#define _CNNEF_CNNEF12_LENGTH                    0x00000001

#define _CNNEF_CNNEF13_POSITION                  0x0000000D
#define _CNNEF_CNNEF13_MASK                      0x00002000
#define _CNNEF_CNNEF13_LENGTH                    0x00000001

#define _CNFF_CNFF0_POSITION                     0x00000000
#define _CNFF_CNFF0_MASK                         0x00000001
#define _CNFF_CNFF0_LENGTH                       0x00000001

#define _CNFF_CNFF1_POSITION                     0x00000001
#define _CNFF_CNFF1_MASK                         0x00000002
#define _CNFF_CNFF1_LENGTH                       0x00000001

#define _CNFF_CNFF5_POSITION                     0x00000005
#define _CNFF_CNFF5_MASK                         0x00000020
#define _CNFF_CNFF5_LENGTH                       0x00000001

#define _CNFF_CNFF6_POSITION                     0x00000006
#define _CNFF_CNFF6_MASK                         0x00000040
#define _CNFF_CNFF6_LENGTH                       0x00000001

#define _CNFF_CNFF7_POSITION                     0x00000007
#define _CNFF_CNFF7_MASK                         0x00000080
#define _CNFF_CNFF7_LENGTH                       0x00000001

#define _CNFF_CNFF9_POSITION                     0x00000009
#define _CNFF_CNFF9_MASK                         0x00000200
#define _CNFF_CNFF9_LENGTH                       0x00000001

#define _CNFF_CNFF10_POSITION                    0x0000000A
#define _CNFF_CNFF10_MASK                        0x00000400
#define _CNFF_CNFF10_LENGTH                      0x00000001

#define _CNFF_CNFF12_POSITION                    0x0000000C
#define _CNFF_CNFF12_MASK                        0x00001000
#define _CNFF_CNFF12_LENGTH                      0x00000001

#define _CNFF_CNFF13_POSITION                    0x0000000D
#define _CNFF_CNFF13_MASK                        0x00002000
#define _CNFF_CNFF13_LENGTH                      0x00000001

#define _SRCON0F_SR0F0_POSITION                  0x00000000
#define _SRCON0F_SR0F0_MASK                      0x00000001
#define _SRCON0F_SR0F0_LENGTH                    0x00000001

#define _SRCON0F_SR0F1_POSITION                  0x00000001
#define _SRCON0F_SR0F1_MASK                      0x00000002
#define _SRCON0F_SR0F1_LENGTH                    0x00000001

#define _SRCON1F_SR1F0_POSITION                  0x00000000
#define _SRCON1F_SR1F0_MASK                      0x00000001
#define _SRCON1F_SR1F0_LENGTH                    0x00000001

#define _SRCON1F_SR1F1_POSITION                  0x00000001
#define _SRCON1F_SR1F1_MASK                      0x00000002
#define _SRCON1F_SR1F1_LENGTH                    0x00000001

#define _ANSELG_ANSG6_POSITION                   0x00000006
#define _ANSELG_ANSG6_MASK                       0x00000040
#define _ANSELG_ANSG6_LENGTH                     0x00000001

#define _ANSELG_ANSG7_POSITION                   0x00000007
#define _ANSELG_ANSG7_MASK                       0x00000080
#define _ANSELG_ANSG7_LENGTH                     0x00000001

#define _ANSELG_ANSG8_POSITION                   0x00000008
#define _ANSELG_ANSG8_MASK                       0x00000100
#define _ANSELG_ANSG8_LENGTH                     0x00000001

#define _ANSELG_ANSG9_POSITION                   0x00000009
#define _ANSELG_ANSG9_MASK                       0x00000200
#define _ANSELG_ANSG9_LENGTH                     0x00000001

#define _ANSELG_ANSG10_POSITION                  0x0000000A
#define _ANSELG_ANSG10_MASK                      0x00000400
#define _ANSELG_ANSG10_LENGTH                    0x00000001

#define _ANSELG_ANSG11_POSITION                  0x0000000B
#define _ANSELG_ANSG11_MASK                      0x00000800
#define _ANSELG_ANSG11_LENGTH                    0x00000001

#define _ANSELG_ANSG15_POSITION                  0x0000000F
#define _ANSELG_ANSG15_MASK                      0x00008000
#define _ANSELG_ANSG15_LENGTH                    0x00000001

#define _ANSELG_w_POSITION                       0x00000000
#define _ANSELG_w_MASK                           0xFFFFFFFF
#define _ANSELG_w_LENGTH                         0x00000020

#define _TRISG_TRISG0_POSITION                   0x00000000
#define _TRISG_TRISG0_MASK                       0x00000001
#define _TRISG_TRISG0_LENGTH                     0x00000001

#define _TRISG_TRISG1_POSITION                   0x00000001
#define _TRISG_TRISG1_MASK                       0x00000002
#define _TRISG_TRISG1_LENGTH                     0x00000001

