Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _C4RXF5_w_POSITION                       0x00000000
#define _C4RXF5_w_MASK                           0xFFFFFFFF
#define _C4RXF5_w_LENGTH                         0x00000020

#define _C4RXF6_EID_POSITION                     0x00000000
#define _C4RXF6_EID_MASK                         0x0003FFFF
#define _C4RXF6_EID_LENGTH                       0x00000012

#define _C4RXF6_EXID_POSITION                    0x00000013
#define _C4RXF6_EXID_MASK                        0x00080000
#define _C4RXF6_EXID_LENGTH                      0x00000001

#define _C4RXF6_SID_POSITION                     0x00000015
#define _C4RXF6_SID_MASK                         0xFFE00000
#define _C4RXF6_SID_LENGTH                       0x0000000B

#define _C4RXF6_w_POSITION                       0x00000000
#define _C4RXF6_w_MASK                           0xFFFFFFFF
#define _C4RXF6_w_LENGTH                         0x00000020

#define _C4RXF7_EID_POSITION                     0x00000000
#define _C4RXF7_EID_MASK                         0x0003FFFF
#define _C4RXF7_EID_LENGTH                       0x00000012

#define _C4RXF7_EXID_POSITION                    0x00000013
#define _C4RXF7_EXID_MASK                        0x00080000
#define _C4RXF7_EXID_LENGTH                      0x00000001

#define _C4RXF7_SID_POSITION                     0x00000015
#define _C4RXF7_SID_MASK                         0xFFE00000
#define _C4RXF7_SID_LENGTH                       0x0000000B

#define _C4RXF7_w_POSITION                       0x00000000
#define _C4RXF7_w_MASK                           0xFFFFFFFF
#define _C4RXF7_w_LENGTH                         0x00000020

#define _C4RXF8_EID_POSITION                     0x00000000
#define _C4RXF8_EID_MASK                         0x0003FFFF
#define _C4RXF8_EID_LENGTH                       0x00000012

#define _C4RXF8_EXID_POSITION                    0x00000013
#define _C4RXF8_EXID_MASK                        0x00080000
#define _C4RXF8_EXID_LENGTH                      0x00000001

#define _C4RXF8_SID_POSITION                     0x00000015
#define _C4RXF8_SID_MASK                         0xFFE00000
#define _C4RXF8_SID_LENGTH                       0x0000000B

#define _C4RXF8_w_POSITION                       0x00000000
#define _C4RXF8_w_MASK                           0xFFFFFFFF
#define _C4RXF8_w_LENGTH                         0x00000020

#define _C4RXF9_EID_POSITION                     0x00000000
#define _C4RXF9_EID_MASK                         0x0003FFFF
#define _C4RXF9_EID_LENGTH                       0x00000012

#define _C4RXF9_EXID_POSITION                    0x00000013
#define _C4RXF9_EXID_MASK                        0x00080000
#define _C4RXF9_EXID_LENGTH                      0x00000001

#define _C4RXF9_SID_POSITION                     0x00000015
#define _C4RXF9_SID_MASK                         0xFFE00000
#define _C4RXF9_SID_LENGTH                       0x0000000B

#define _C4RXF9_w_POSITION                       0x00000000
#define _C4RXF9_w_MASK                           0xFFFFFFFF
#define _C4RXF9_w_LENGTH                         0x00000020

#define _C4RXF10_EID_POSITION                    0x00000000
#define _C4RXF10_EID_MASK                        0x0003FFFF
#define _C4RXF10_EID_LENGTH                      0x00000012

#define _C4RXF10_EXID_POSITION                   0x00000013
#define _C4RXF10_EXID_MASK                       0x00080000
#define _C4RXF10_EXID_LENGTH                     0x00000001

#define _C4RXF10_SID_POSITION                    0x00000015
#define _C4RXF10_SID_MASK                        0xFFE00000
#define _C4RXF10_SID_LENGTH                      0x0000000B

#define _C4RXF10_w_POSITION                      0x00000000
#define _C4RXF10_w_MASK                          0xFFFFFFFF
#define _C4RXF10_w_LENGTH                        0x00000020

#define _C4RXF11_EID_POSITION                    0x00000000
#define _C4RXF11_EID_MASK                        0x0003FFFF
#define _C4RXF11_EID_LENGTH                      0x00000012

#define _C4RXF11_EXID_POSITION                   0x00000013
#define _C4RXF11_EXID_MASK                       0x00080000
#define _C4RXF11_EXID_LENGTH                     0x00000001

#define _C4RXF11_SID_POSITION                    0x00000015
#define _C4RXF11_SID_MASK                        0xFFE00000
#define _C4RXF11_SID_LENGTH                      0x0000000B

#define _C4RXF11_w_POSITION                      0x00000000
#define _C4RXF11_w_MASK                          0xFFFFFFFF
#define _C4RXF11_w_LENGTH                        0x00000020

#define _C4RXF12_EID_POSITION                    0x00000000
#define _C4RXF12_EID_MASK                        0x0003FFFF
#define _C4RXF12_EID_LENGTH                      0x00000012

#define _C4RXF12_EXID_POSITION                   0x00000013
#define _C4RXF12_EXID_MASK                       0x00080000
#define _C4RXF12_EXID_LENGTH                     0x00000001

#define _C4RXF12_SID_POSITION                    0x00000015
#define _C4RXF12_SID_MASK                        0xFFE00000
#define _C4RXF12_SID_LENGTH                      0x0000000B

#define _C4RXF12_w_POSITION                      0x00000000
#define _C4RXF12_w_MASK                          0xFFFFFFFF
#define _C4RXF12_w_LENGTH                        0x00000020

#define _C4RXF13_EID_POSITION                    0x00000000
#define _C4RXF13_EID_MASK                        0x0003FFFF
#define _C4RXF13_EID_LENGTH                      0x00000012

#define _C4RXF13_EXID_POSITION                   0x00000013
#define _C4RXF13_EXID_MASK                       0x00080000
#define _C4RXF13_EXID_LENGTH                     0x00000001

#define _C4RXF13_SID_POSITION                    0x00000015
#define _C4RXF13_SID_MASK                        0xFFE00000
#define _C4RXF13_SID_LENGTH                      0x0000000B

#define _C4RXF13_w_POSITION                      0x00000000
#define _C4RXF13_w_MASK                          0xFFFFFFFF
#define _C4RXF13_w_LENGTH                        0x00000020

#define _C4RXF14_EID_POSITION                    0x00000000
#define _C4RXF14_EID_MASK                        0x0003FFFF
#define _C4RXF14_EID_LENGTH                      0x00000012

#define _C4RXF14_EXID_POSITION                   0x00000013
#define _C4RXF14_EXID_MASK                       0x00080000
#define _C4RXF14_EXID_LENGTH                     0x00000001

