Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _ADCFLTR2_DFMODE_POSITION                0x0000001D
#define _ADCFLTR2_DFMODE_MASK                    0x20000000
#define _ADCFLTR2_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR2_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR2_DATA16EN_MASK                  0x40000000
#define _ADCFLTR2_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR2_AFEN_POSITION                  0x0000001F
#define _ADCFLTR2_AFEN_MASK                      0x80000000
#define _ADCFLTR2_AFEN_LENGTH                    0x00000001

#define _ADCFLTR3_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR3_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR3_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR3_CHNLID_POSITION                0x00000010
#define _ADCFLTR3_CHNLID_MASK                    0x001F0000
#define _ADCFLTR3_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR3_AFRDY_POSITION                 0x00000018
#define _ADCFLTR3_AFRDY_MASK                     0x01000000
#define _ADCFLTR3_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR3_AFGIEN_POSITION                0x00000019
#define _ADCFLTR3_AFGIEN_MASK                    0x02000000
#define _ADCFLTR3_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR3_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR3_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR3_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR3_DFMODE_POSITION                0x0000001D
#define _ADCFLTR3_DFMODE_MASK                    0x20000000
#define _ADCFLTR3_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR3_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR3_DATA16EN_MASK                  0x40000000
#define _ADCFLTR3_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR3_AFEN_POSITION                  0x0000001F
#define _ADCFLTR3_AFEN_MASK                      0x80000000
#define _ADCFLTR3_AFEN_LENGTH                    0x00000001

#define _ADCFLTR4_FLTRDATA_POSITION              0x00000000
#define _ADCFLTR4_FLTRDATA_MASK                  0x0000FFFF
#define _ADCFLTR4_FLTRDATA_LENGTH                0x00000010

#define _ADCFLTR4_CHNLID_POSITION                0x00000010
#define _ADCFLTR4_CHNLID_MASK                    0x001F0000
#define _ADCFLTR4_CHNLID_LENGTH                  0x00000005

#define _ADCFLTR4_AFRDY_POSITION                 0x00000018
#define _ADCFLTR4_AFRDY_MASK                     0x01000000
#define _ADCFLTR4_AFRDY_LENGTH                   0x00000001

#define _ADCFLTR4_AFGIEN_POSITION                0x00000019
#define _ADCFLTR4_AFGIEN_MASK                    0x02000000
#define _ADCFLTR4_AFGIEN_LENGTH                  0x00000001

#define _ADCFLTR4_OVRSAM_POSITION                0x0000001A
#define _ADCFLTR4_OVRSAM_MASK                    0x1C000000
#define _ADCFLTR4_OVRSAM_LENGTH                  0x00000003

#define _ADCFLTR4_DFMODE_POSITION                0x0000001D
#define _ADCFLTR4_DFMODE_MASK                    0x20000000
#define _ADCFLTR4_DFMODE_LENGTH                  0x00000001

#define _ADCFLTR4_DATA16EN_POSITION              0x0000001E
#define _ADCFLTR4_DATA16EN_MASK                  0x40000000
#define _ADCFLTR4_DATA16EN_LENGTH                0x00000001

#define _ADCFLTR4_AFEN_POSITION                  0x0000001F
#define _ADCFLTR4_AFEN_MASK                      0x80000000
#define _ADCFLTR4_AFEN_LENGTH                    0x00000001

#define _ADCTRG1_TRGSRC0_POSITION                0x00000000
#define _ADCTRG1_TRGSRC0_MASK                    0x0000001F
#define _ADCTRG1_TRGSRC0_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC1_POSITION                0x00000008
#define _ADCTRG1_TRGSRC1_MASK                    0x00001F00
#define _ADCTRG1_TRGSRC1_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC2_POSITION                0x00000010
#define _ADCTRG1_TRGSRC2_MASK                    0x001F0000
#define _ADCTRG1_TRGSRC2_LENGTH                  0x00000005

#define _ADCTRG1_TRGSRC3_POSITION                0x00000018
#define _ADCTRG1_TRGSRC3_MASK                    0x1F000000
#define _ADCTRG1_TRGSRC3_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC4_POSITION                0x00000000
#define _ADCTRG2_TRGSRC4_MASK                    0x0000001F
#define _ADCTRG2_TRGSRC4_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC5_POSITION                0x00000008
#define _ADCTRG2_TRGSRC5_MASK                    0x00001F00
#define _ADCTRG2_TRGSRC5_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC6_POSITION                0x00000010
#define _ADCTRG2_TRGSRC6_MASK                    0x001F0000
#define _ADCTRG2_TRGSRC6_LENGTH                  0x00000005

#define _ADCTRG2_TRGSRC7_POSITION                0x00000018
#define _ADCTRG2_TRGSRC7_MASK                    0x1F000000
#define _ADCTRG2_TRGSRC7_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC8_POSITION                0x00000000
#define _ADCTRG3_TRGSRC8_MASK                    0x0000001F
#define _ADCTRG3_TRGSRC8_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC9_POSITION                0x00000008
#define _ADCTRG3_TRGSRC9_MASK                    0x00001F00
#define _ADCTRG3_TRGSRC9_LENGTH                  0x00000005

#define _ADCTRG3_TRGSRC10_POSITION               0x00000010
#define _ADCTRG3_TRGSRC10_MASK                   0x001F0000
#define _ADCTRG3_TRGSRC10_LENGTH                 0x00000005

#define _ADCTRG3_TRGSRC11_POSITION               0x00000018
#define _ADCTRG3_TRGSRC11_MASK                   0x1F000000
#define _ADCTRG3_TRGSRC11_LENGTH                 0x00000005

#define _ADCTRG4_TRGSRC12_POSITION               0x00000000
#define _ADCTRG4_TRGSRC12_MASK                   0x0000001F
#define _ADCTRG4_TRGSRC12_LENGTH                 0x00000005

#define _ADCTRG4_TRGSRC13_POSITION               0x00000008
#define _ADCTRG4_TRGSRC13_MASK                   0x00001F00
#define _ADCTRG4_TRGSRC13_LENGTH                 0x00000005

#define _ADCTRG4_TRGSRC14_POSITION               0x00000010
#define _ADCTRG4_TRGSRC14_MASK                   0x001F0000
#define _ADCTRG4_TRGSRC14_LENGTH                 0x00000005

#define _ADCTRG4_TRGSRC15_POSITION               0x00000018
#define _ADCTRG4_TRGSRC15_MASK                   0x1F000000
#define _ADCTRG4_TRGSRC15_LENGTH                 0x00000005

#define _ADCTRG5_TRGSRC16_POSITION               0x00000000
#define _ADCTRG5_TRGSRC16_MASK                   0x0000001F
#define _ADCTRG5_TRGSRC16_LENGTH                 0x00000005

#define _ADCTRG5_TRGSRC17_POSITION               0x00000008
#define _ADCTRG5_TRGSRC17_MASK                   0x00001F00
#define _ADCTRG5_TRGSRC17_LENGTH                 0x00000005

