Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _U2OTGIE_VBUSVDIE_POSITION               0x00000000
#define _U2OTGIE_VBUSVDIE_MASK                   0x00000001
#define _U2OTGIE_VBUSVDIE_LENGTH                 0x00000001

#define _U2OTGIE_SESENDIE_POSITION               0x00000002
#define _U2OTGIE_SESENDIE_MASK                   0x00000004
#define _U2OTGIE_SESENDIE_LENGTH                 0x00000001

#define _U2OTGIE_SESVDIE_POSITION                0x00000003
#define _U2OTGIE_SESVDIE_MASK                    0x00000008
#define _U2OTGIE_SESVDIE_LENGTH                  0x00000001

#define _U2OTGIE_ACTVIE_POSITION                 0x00000004
#define _U2OTGIE_ACTVIE_MASK                     0x00000010
#define _U2OTGIE_ACTVIE_LENGTH                   0x00000001

#define _U2OTGIE_LSTATEIE_POSITION               0x00000005
#define _U2OTGIE_LSTATEIE_MASK                   0x00000020
#define _U2OTGIE_LSTATEIE_LENGTH                 0x00000001

#define _U2OTGIE_T1MSECIE_POSITION               0x00000006
#define _U2OTGIE_T1MSECIE_MASK                   0x00000040
#define _U2OTGIE_T1MSECIE_LENGTH                 0x00000001

#define _U2OTGIE_IDIE_POSITION                   0x00000007
#define _U2OTGIE_IDIE_MASK                       0x00000080
#define _U2OTGIE_IDIE_LENGTH                     0x00000001

#define _U2OTGSTAT_VBUSVD_POSITION               0x00000000
#define _U2OTGSTAT_VBUSVD_MASK                   0x00000001
#define _U2OTGSTAT_VBUSVD_LENGTH                 0x00000001

#define _U2OTGSTAT_SESEND_POSITION               0x00000002
#define _U2OTGSTAT_SESEND_MASK                   0x00000004
#define _U2OTGSTAT_SESEND_LENGTH                 0x00000001

#define _U2OTGSTAT_SESVD_POSITION                0x00000003
#define _U2OTGSTAT_SESVD_MASK                    0x00000008
#define _U2OTGSTAT_SESVD_LENGTH                  0x00000001

#define _U2OTGSTAT_LSTATE_POSITION               0x00000005
#define _U2OTGSTAT_LSTATE_MASK                   0x00000020
#define _U2OTGSTAT_LSTATE_LENGTH                 0x00000001

#define _U2OTGSTAT_ID_POSITION                   0x00000007
#define _U2OTGSTAT_ID_MASK                       0x00000080
#define _U2OTGSTAT_ID_LENGTH                     0x00000001

#define _U2OTGCON_VBUSDIS_POSITION               0x00000000
#define _U2OTGCON_VBUSDIS_MASK                   0x00000001
#define _U2OTGCON_VBUSDIS_LENGTH                 0x00000001

#define _U2OTGCON_VBUSCHG_POSITION               0x00000001
#define _U2OTGCON_VBUSCHG_MASK                   0x00000002
#define _U2OTGCON_VBUSCHG_LENGTH                 0x00000001

#define _U2OTGCON_OTGEN_POSITION                 0x00000002
#define _U2OTGCON_OTGEN_MASK                     0x00000004
#define _U2OTGCON_OTGEN_LENGTH                   0x00000001

#define _U2OTGCON_VBUSON_POSITION                0x00000003
#define _U2OTGCON_VBUSON_MASK                    0x00000008
#define _U2OTGCON_VBUSON_LENGTH                  0x00000001

#define _U2OTGCON_DMPULDWN_POSITION              0x00000004
#define _U2OTGCON_DMPULDWN_MASK                  0x00000010
#define _U2OTGCON_DMPULDWN_LENGTH                0x00000001

#define _U2OTGCON_DPPULDWN_POSITION              0x00000005
#define _U2OTGCON_DPPULDWN_MASK                  0x00000020
#define _U2OTGCON_DPPULDWN_LENGTH                0x00000001

#define _U2OTGCON_DMPULUP_POSITION               0x00000006
#define _U2OTGCON_DMPULUP_MASK                   0x00000040
#define _U2OTGCON_DMPULUP_LENGTH                 0x00000001

#define _U2OTGCON_DPPULUP_POSITION               0x00000007
#define _U2OTGCON_DPPULUP_MASK                   0x00000080
#define _U2OTGCON_DPPULUP_LENGTH                 0x00000001

#define _U2PWRC_USBPWR_POSITION                  0x00000000
#define _U2PWRC_USBPWR_MASK                      0x00000001
#define _U2PWRC_USBPWR_LENGTH                    0x00000001

#define _U2PWRC_USUSPEND_POSITION                0x00000001
#define _U2PWRC_USUSPEND_MASK                    0x00000002
#define _U2PWRC_USUSPEND_LENGTH                  0x00000001

#define _U2PWRC_USBBUSY_POSITION                 0x00000003
#define _U2PWRC_USBBUSY_MASK                     0x00000008
#define _U2PWRC_USBBUSY_LENGTH                   0x00000001

#define _U2PWRC_USLPGRD_POSITION                 0x00000004
#define _U2PWRC_USLPGRD_MASK                     0x00000010
#define _U2PWRC_USLPGRD_LENGTH                   0x00000001

#define _U2PWRC_UACTPND_POSITION                 0x00000007
#define _U2PWRC_UACTPND_MASK                     0x00000080
#define _U2PWRC_UACTPND_LENGTH                   0x00000001

#define _U2IR_URSTIF_DETACHIF_POSITION           0x00000000
#define _U2IR_URSTIF_DETACHIF_MASK               0x00000001
#define _U2IR_URSTIF_DETACHIF_LENGTH             0x00000001

#define _U2IR_UERRIF_POSITION                    0x00000001
#define _U2IR_UERRIF_MASK                        0x00000002
#define _U2IR_UERRIF_LENGTH                      0x00000001

#define _U2IR_SOFIF_POSITION                     0x00000002
#define _U2IR_SOFIF_MASK                         0x00000004
#define _U2IR_SOFIF_LENGTH                       0x00000001

#define _U2IR_TRNIF_POSITION                     0x00000003
#define _U2IR_TRNIF_MASK                         0x00000008
#define _U2IR_TRNIF_LENGTH                       0x00000001

#define _U2IR_IDLEIF_POSITION                    0x00000004
#define _U2IR_IDLEIF_MASK                        0x00000010
#define _U2IR_IDLEIF_LENGTH                      0x00000001

#define _U2IR_RESUMEIF_POSITION                  0x00000005
#define _U2IR_RESUMEIF_MASK                      0x00000020
#define _U2IR_RESUMEIF_LENGTH                    0x00000001

#define _U2IR_ATTACHIF_POSITION                  0x00000006
#define _U2IR_ATTACHIF_MASK                      0x00000040
#define _U2IR_ATTACHIF_LENGTH                    0x00000001

#define _U2IR_STALLIF_POSITION                   0x00000007
#define _U2IR_STALLIF_MASK                       0x00000080
#define _U2IR_STALLIF_LENGTH                     0x00000001

#define _U2IR_DETACHIF_POSITION                  0x00000000
#define _U2IR_DETACHIF_MASK                      0x00000001
#define _U2IR_DETACHIF_LENGTH                    0x00000001

#define _U2IR_URSTIF_POSITION                    0x00000000
#define _U2IR_URSTIF_MASK                        0x00000001
#define _U2IR_URSTIF_LENGTH                      0x00000001

#define _U2IE_URSTIE_DETACHIE_POSITION           0x00000000
#define _U2IE_URSTIE_DETACHIE_MASK               0x00000001
#define _U2IE_URSTIE_DETACHIE_LENGTH             0x00000001

#define _U2IE_UERRIE_POSITION                    0x00000001
#define _U2IE_UERRIE_MASK                        0x00000002
#define _U2IE_UERRIE_LENGTH                      0x00000001

#define _U2IE_SOFIE_POSITION                     0x00000002
#define _U2IE_SOFIE_MASK                         0x00000004
#define _U2IE_SOFIE_LENGTH                       0x00000001

#define _U2IE_TRNIE_POSITION                     0x00000003
#define _U2IE_TRNIE_MASK                         0x00000008
#define _U2IE_TRNIE_LENGTH                       0x00000001

