Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.5.115/include/proc/p32mk0512mcf100.h
#define _U2IE_IDLEIE_POSITION                    0x00000004
#define _U2IE_IDLEIE_MASK                        0x00000010
#define _U2IE_IDLEIE_LENGTH                      0x00000001

#define _U2IE_RESUMEIE_POSITION                  0x00000005
#define _U2IE_RESUMEIE_MASK                      0x00000020
#define _U2IE_RESUMEIE_LENGTH                    0x00000001

#define _U2IE_ATTACHIE_POSITION                  0x00000006
#define _U2IE_ATTACHIE_MASK                      0x00000040
#define _U2IE_ATTACHIE_LENGTH                    0x00000001

#define _U2IE_STALLIE_POSITION                   0x00000007
#define _U2IE_STALLIE_MASK                       0x00000080
#define _U2IE_STALLIE_LENGTH                     0x00000001

#define _U2IE_DETACHIE_POSITION                  0x00000000
#define _U2IE_DETACHIE_MASK                      0x00000001
#define _U2IE_DETACHIE_LENGTH                    0x00000001

#define _U2IE_URSTIE_POSITION                    0x00000000
#define _U2IE_URSTIE_MASK                        0x00000001
#define _U2IE_URSTIE_LENGTH                      0x00000001

#define _U2EIR_PIDEF_POSITION                    0x00000000
#define _U2EIR_PIDEF_MASK                        0x00000001
#define _U2EIR_PIDEF_LENGTH                      0x00000001

#define _U2EIR_CRC5EF_EOFEF_POSITION             0x00000001
#define _U2EIR_CRC5EF_EOFEF_MASK                 0x00000002
#define _U2EIR_CRC5EF_EOFEF_LENGTH               0x00000001

#define _U2EIR_CRC16EF_POSITION                  0x00000002
#define _U2EIR_CRC16EF_MASK                      0x00000004
#define _U2EIR_CRC16EF_LENGTH                    0x00000001

#define _U2EIR_DFN8EF_POSITION                   0x00000003
#define _U2EIR_DFN8EF_MASK                       0x00000008
#define _U2EIR_DFN8EF_LENGTH                     0x00000001

#define _U2EIR_BTOEF_POSITION                    0x00000004
#define _U2EIR_BTOEF_MASK                        0x00000010
#define _U2EIR_BTOEF_LENGTH                      0x00000001

#define _U2EIR_DMAEF_POSITION                    0x00000005
#define _U2EIR_DMAEF_MASK                        0x00000020
#define _U2EIR_DMAEF_LENGTH                      0x00000001

#define _U2EIR_BMXEF_POSITION                    0x00000006
#define _U2EIR_BMXEF_MASK                        0x00000040
#define _U2EIR_BMXEF_LENGTH                      0x00000001

#define _U2EIR_BTSEF_POSITION                    0x00000007
#define _U2EIR_BTSEF_MASK                        0x00000080
#define _U2EIR_BTSEF_LENGTH                      0x00000001

#define _U2EIR_CRC5EF_POSITION                   0x00000001
#define _U2EIR_CRC5EF_MASK                       0x00000002
#define _U2EIR_CRC5EF_LENGTH                     0x00000001

#define _U2EIR_EOFEF_POSITION                    0x00000001
#define _U2EIR_EOFEF_MASK                        0x00000002
#define _U2EIR_EOFEF_LENGTH                      0x00000001

#define _U2EIE_PIDEE_POSITION                    0x00000000
#define _U2EIE_PIDEE_MASK                        0x00000001
#define _U2EIE_PIDEE_LENGTH                      0x00000001

#define _U2EIE_CRC5EE_EOFEE_POSITION             0x00000001
#define _U2EIE_CRC5EE_EOFEE_MASK                 0x00000002
#define _U2EIE_CRC5EE_EOFEE_LENGTH               0x00000001

#define _U2EIE_CRC16EE_POSITION                  0x00000002
#define _U2EIE_CRC16EE_MASK                      0x00000004
#define _U2EIE_CRC16EE_LENGTH                    0x00000001

#define _U2EIE_DFN8EE_POSITION                   0x00000003
#define _U2EIE_DFN8EE_MASK                       0x00000008
#define _U2EIE_DFN8EE_LENGTH                     0x00000001

#define _U2EIE_BTOEE_POSITION                    0x00000004
#define _U2EIE_BTOEE_MASK                        0x00000010
#define _U2EIE_BTOEE_LENGTH                      0x00000001

#define _U2EIE_DMAEE_POSITION                    0x00000005
#define _U2EIE_DMAEE_MASK                        0x00000020
#define _U2EIE_DMAEE_LENGTH                      0x00000001

#define _U2EIE_BMXEE_POSITION                    0x00000006
#define _U2EIE_BMXEE_MASK                        0x00000040
#define _U2EIE_BMXEE_LENGTH                      0x00000001

#define _U2EIE_BTSEE_POSITION                    0x00000007
#define _U2EIE_BTSEE_MASK                        0x00000080
#define _U2EIE_BTSEE_LENGTH                      0x00000001

#define _U2EIE_CRC5EE_POSITION                   0x00000001
#define _U2EIE_CRC5EE_MASK                       0x00000002
#define _U2EIE_CRC5EE_LENGTH                     0x00000001

#define _U2EIE_EOFEE_POSITION                    0x00000001
#define _U2EIE_EOFEE_MASK                        0x00000002
#define _U2EIE_EOFEE_LENGTH                      0x00000001

#define _U2STAT_PPBI_POSITION                    0x00000002
#define _U2STAT_PPBI_MASK                        0x00000004
#define _U2STAT_PPBI_LENGTH                      0x00000001

#define _U2STAT_DIR_POSITION                     0x00000003
#define _U2STAT_DIR_MASK                         0x00000008
#define _U2STAT_DIR_LENGTH                       0x00000001

#define _U2STAT_ENDPT_POSITION                   0x00000004
#define _U2STAT_ENDPT_MASK                       0x000000F0
#define _U2STAT_ENDPT_LENGTH                     0x00000004

#define _U2STAT_ENDPT0_POSITION                  0x00000004
#define _U2STAT_ENDPT0_MASK                      0x00000010
#define _U2STAT_ENDPT0_LENGTH                    0x00000001

#define _U2STAT_ENDPT1_POSITION                  0x00000005
#define _U2STAT_ENDPT1_MASK                      0x00000020
#define _U2STAT_ENDPT1_LENGTH                    0x00000001

#define _U2STAT_ENDPT2_POSITION                  0x00000006
#define _U2STAT_ENDPT2_MASK                      0x00000040
#define _U2STAT_ENDPT2_LENGTH                    0x00000001

#define _U2STAT_ENDPT3_POSITION                  0x00000007
#define _U2STAT_ENDPT3_MASK                      0x00000080
#define _U2STAT_ENDPT3_LENGTH                    0x00000001

#define _U2CON_USBEN_SOFEN_POSITION              0x00000000
#define _U2CON_USBEN_SOFEN_MASK                  0x00000001
#define _U2CON_USBEN_SOFEN_LENGTH                0x00000001

